
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыбраннаяДата = НачалоМесяца(ТекущаяУниверсальнаяДата());
	Если Параметры.Свойство("НачальнаяДата") Тогда
		ВыбраннаяДата = Параметры.НачальнаяДата;
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	ТекущийГод = Год(ВыбраннаяДата);
	ТекущийМесяц = Месяц(ВыбраннаяДата);
	
	// Добавялем на форму кнопки выбора месяца
	НомерМесяца = 1;
	Для СчГрупп = 0 По 2 Цикл
		// Получаем группу-владельца
		ГруппаФормы = ЭтотОбъект;
		Если СчГрупп = 0 Тогда
			ГруппаФормы = Элементы.Найти("ГруппаЛев");
		ИначеЕсли СчГрупп = 1 Тогда
			ГруппаФормы = Элементы.Найти("ГруппаСред");
		Иначе
			ГруппаФормы = Элементы.Найти("ГруппаПрав");
		КонецЕсли;
		// Добавляем кнопки по 4 в группу
		Для Сч = 0 По 3 Цикл
			ИмяКнопки = ПолучитьИмяКнопкиМесяца(НомерМесяца);
			НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаФормы);	
			НоваяКнопка.ИмяКоманды = "ВыбратьМесяц";
			НоваяКнопка.РастягиватьПоГоризонтали = Истина;
			ДатаМесяца = Дата(2000, НомерМесяца, 1);
			НоваяКнопка.Заголовок = Формат(ДатаМесяца, "ДФ=MMMM;"); 
			// Сразу выделяем кнопку текущего месяца
			Если НомерМесяца = ТекущийМесяц Тогда
				НоваяКнопка.Шрифт = ПолучитьШрифтВыделения();
				НоваяКнопка.ЦветТекста = ПолучитьЦветВыделения();
			КонецЕсли;
			НомерМесяца = НомерМесяца + 1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВыбранныйГод();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьМесяц(Команда)	
	Для Каждого Элемент Из Элементы Цикл
		СброситьСтиль = (СтрНачинаетсяС(Элемент.Имя, "кн_")
			И ТипЗнч(Элемент) = Тип("КнопкаФормы")
			И Элемент <> ТекущийЭлемент);
		Если СброситьСтиль Тогда
			Элемент.Шрифт = Новый Шрифт();
			Элемент.ЦветТекста = Новый Цвет();
		КонецЕсли;
	КонецЦикла;
	
	// Выделяем нажатук кнопку и получаем месяц
	Если ТипЗнч(ТекущийЭлемент) = Тип("КнопкаФормы") Тогда
		ТекущийЭлемент.Шрифт = ПолучитьШрифтВыделения();
		ТекущийЭлемент.ЦветТекста = ПолучитьЦветВыделения();
		НомерМесяца = Число(Сред(ТекущийЭлемент.Имя, 4));
		Если НомерМесяца > 0 Тогда
			ТекущийМесяц = Номермесяца;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьГод(Команда)
	ТекущийГод = ?(ТекущийГод > 0, ТекущийГод - 1, 0);
	УстановитьВыбранныйГод();
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьГод(Команда)
	ТекущийГод = ТекущийГод + 1;
	УстановитьВыбранныйГод();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбраннаяДата = Дата(ТекущийГод, ТекущийМесяц, 1);
	Закрыть(ВыбраннаяДата);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВыбранныйГод()
	КнопкаГода = Элементы.Найти("ВыбратьГод");
	Если КнопкаГода <> Неопределено Тогда
		КнопкаГода.Заголовок = Формат(ТекущийГод, "ЧГ=0;");
	КонецЕсли;		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяКнопкиМесяца(НомерМесяца)
	Возврат СтрШаблон("кн_%1", НомерМесяца);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШрифтВыделения()
    Возврат ШрифтыСтиля.ШрифтЖирный;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЦветВыделения()
    Возврат ЦветаСтиля.ЦветВажного;
КонецФункции

#КонецОбласти
