
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОтборПоВидуПродукции = Новый Структура;
	ОтборПоВидуПродукции.Вставить("ВидыПродукции", ПараметрКоманды);

	ПараметрыФормы = Новый Структура("Отбор", ОтборПоВидуПродукции);
	ОткрытьФорму("Справочник.МоделиПродукции.Форма.ФормаСпискаСОтбором", 
				ПараметрыФормы, 
				ПараметрыВыполненияКоманды.Источник, 
				ПараметрыВыполненияКоманды.Уникальность, 
				ПараметрыВыполненияКоманды.Окно, 
				ПараметрыВыполненияКоманды.НавигационнаяСсылка); 
				
КонецПроцедуры

#КонецОбласти