#Область ОбработчикиСобытий
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистры 
	Движения.КонтрагентыИДата.Записывать = Истина;
	Движения.РемонтыИПродукция.Записывать = Истина;
	Движения.ФабрикиИСмены.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетОРемонтах.СервисныйЦентр КАК СервисныйЦентр,
		|	ОтчетОРемонтахРемонты.Ремонт.ДатаПокупки КАК РемонтДатаПокупки,
		|	ОтчетОРемонтахРемонты.Ремонт.ДатаНачалаРемонта КАК РемонтДатаНачалаРемонта,
		|	ОтчетОРемонтахРемонты.Ремонт.СуммаЗаВыезд КАК РемонтСуммаЗаВыезд,
		|	ОтчетОРемонтахРемонты.Ремонт.СуммаЗаДетали КАК РемонтСуммаЗаДетали,
		|	ОтчетОРемонтахРемонты.Ремонт.СуммаЗаРаботы КАК РемонтСуммаЗаРаботы,
		|	ОтчетОРемонтахРемонты.Ремонт.СуммаИтого КАК РемонтСуммаИтого,
		|	ВЫБОР
		|		КОГДА ОтчетОРемонтахРемонты.Ремонт.ДатаПокупки <> ДАТАВРЕМЯ(1, 1, 1)
		|				И ОтчетОРемонтахРемонты.Ремонт.ДатаНачалаРемонта <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА РАЗНОСТЬДАТ(ОтчетОРемонтахРемонты.Ремонт.ДатаПокупки, ОтчетОРемонтахРемонты.Ремонт.ДатаНачалаРемонта, ДЕНЬ)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СрокЭксплуатации,
		|	1 КАК Количество,
		|	ОтчетОРемонтахРемонты.Ремонт.ВидПродукции КАК РемонтВидПродукции,
		|	ОтчетОРемонтахРемонты.Ремонт.МодельПродукции КАК РемонтМодельПродукции,
		|	ОтчетОРемонтахРемонты.Ремонт.КодНеисправности КАК РемонтКодНеисправности,
		|	ОтчетОРемонтахРемонты.Ремонт.Производитель КАК РемонтПроизводитель,
		|	ОтчетОРемонтахРемонты.Ремонт.ПроизводственнаяСмена КАК РемонтПроизводственнаяСмена,
		|	ОтчетОРемонтахРемонты.Ремонт.ДатаПроизводства КАК РемонтДатаПроизводства,
		|	ОтчетОРемонтах.Дата КАК ДатаОтчета
		|ИЗ
		|	Документ.ОтчетОРемонтах.Ремонты КАК ОтчетОРемонтахРемонты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРемонтах КАК ОтчетОРемонтах
		|		ПО ОтчетОРемонтахРемонты.Ссылка = ОтчетОРемонтах.Ссылка
		|ГДЕ
		|	ОтчетОРемонтах.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДвижениеКонтрагентыИДата = Движения.КонтрагентыИДата.Добавить();
		ДвижениеКонтрагентыИДата.Период = ВыборкаДетальныеЗаписи.РемонтДатаНачалаРемонта;
		ДвижениеРемонтыИПродукция = Движения.РемонтыИПродукция.Добавить();
		ДвижениеРемонтыИПродукция.Период = ВыборкаДетальныеЗаписи.РемонтДатаНачалаРемонта;
		ДвижениеФабрикиИСмены = Движения.ФабрикиИСмены.Добавить(); 
		ДвижениеФабрикиИСмены.Период = ВыборкаДетальныеЗаписи.РемонтДатаНачалаРемонта;
		// регистр КонтрагентыИДата 
		
		ДвижениеКонтрагентыИДата.СервисныйЦентр  = ВыборкаДетальныеЗаписи.СервисныйЦентр;
        ДвижениеКонтрагентыИДата.ДатаПокупки  = ВыборкаДетальныеЗаписи.РемонтДатаПокупки;
        ДвижениеКонтрагентыИДата.СрокВЭксплуатации = ВыборкаДетальныеЗаписи.СрокЭксплуатации;
		ДвижениеКонтрагентыИДата.СуммаЗаВыезд = ВыборкаДетальныеЗаписи.РемонтСуммаЗаВыезд;
        ДвижениеКонтрагентыИДата.СуммаЗаДетали = ВыборкаДетальныеЗаписи.РемонтСуммаЗаДетали;
        ДвижениеКонтрагентыИДата.СуммаЗаРаботы = ВыборкаДетальныеЗаписи.РемонтСуммаЗаРаботы;
        ДвижениеКонтрагентыИДата.СуммаИтого = ВыборкаДетальныеЗаписи.РемонтСуммаИтого;
        ДвижениеКонтрагентыИДата.Количество = ВыборкаДетальныеЗаписи.Количество;
		// регистр РемонтыИПродукция 
		ДвижениеРемонтыИПродукция.ВидПродукции = ВыборкаДетальныеЗаписи.РемонтВидПродукции;
		ДвижениеРемонтыИПродукция.МодельПродукции = ВыборкаДетальныеЗаписи.РемонтМодельПродукции; 
		ДвижениеРемонтыИПродукция.КодНеисправности = ВыборкаДетальныеЗаписи.РемонтКодНеисправности;
		ДвижениеРемонтыИПродукция.СуммаЗаВыезд = ВыборкаДетальныеЗаписи.РемонтСуммаЗаВыезд;
        ДвижениеРемонтыИПродукция.СуммаЗаДетали = ВыборкаДетальныеЗаписи.РемонтСуммаЗаДетали;
        ДвижениеРемонтыИПродукция.СуммаЗаРаботы = ВыборкаДетальныеЗаписи.РемонтСуммаЗаРаботы;
        ДвижениеРемонтыИПродукция.СуммаИтого = ВыборкаДетальныеЗаписи.РемонтСуммаИтого;
        ДвижениеРемонтыИПродукция.Количество = ВыборкаДетальныеЗаписи.Количество;
		//Регистр ФабрикиИСмены
		ДвижениеФабрикиИСмены.Фабрика = ВыборкаДетальныеЗаписи.РемонтПроизводитель;
		ДвижениеФабрикиИСмены.Смена = ВыборкаДетальныеЗаписи.РемонтПроизводственнаяСмена;
		ДвижениеФабрикиИСмены.ДатаПроизводства = ВыборкаДетальныеЗаписи.РемонтДатаПроизводства; 
		ДвижениеФабрикиИСмены.СуммаЗаВыезд = ВыборкаДетальныеЗаписи.РемонтСуммаЗаВыезд;
        ДвижениеФабрикиИСмены.СуммаЗаДетали = ВыборкаДетальныеЗаписи.РемонтСуммаЗаДетали;
        ДвижениеФабрикиИСмены.СуммаЗаРаботы = ВыборкаДетальныеЗаписи.РемонтСуммаЗаРаботы;
        ДвижениеФабрикиИСмены.СуммаИтого = ВыборкаДетальныеЗаписи.РемонтСуммаИтого;
        ДвижениеФабрикиИСмены.Количество = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецЕсли
#КонецОбласти
