
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	ДанныеОтчетаПериод = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	ДатаНачала = ДанныеОтчетаПериод[0].Значение.ДатаНачала;
	ДатаОкончания = ДанныеОтчетаПериод[0].Значение.ДатаОкончания;
	
	ГодНачала = Год(ДатаНачала);
	ГодОкончния = Год(ДатаОкончания);
	
	РазницаДней = (КонецДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / 86400;
	КоличествоЛетРасчет = РазницаДней / 365;
	КоличествоЛетРасчетВСКГод = РазницаДней / 366;
	
	Если КоличествоЛетРасчет <= 1 Тогда
		КоличествоЛет = 1;
	ИначеЕсли Окр(КоличествоЛетРасчет, 2, РежимОкругления.Окр15как20) > Цел(КоличествоЛетРасчет) Тогда
		КоличествоЛет = Цел(КоличествоЛетРасчет) + 1;
	Иначе
		КоличествоЛет = Цел(КоличествоЛетРасчет);
	КонецЕсли;
	
	ГодыОтчета = Новый Соответствие;
	ГодыОтчета.Вставить(1, ГодНачала);
	
	Для Сч = 1 По КоличествоЛет - 1 Цикл
		ОчереднойГод = ГодНачала + Сч;
		ГодыОтчета.Вставить(Сч + 1, Число(ОчереднойГод));
	КонецЦикла;
	
	Если КоличествоЛет > 1 Тогда
		КомпоновщикНастроек.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ТипДиаграммы", ТипДиаграммы.ГистограммаОбъемная);
		НастройкаГистограммы();
	КонецЕсли;
	
	Если КоличествоЛет <= 1 Тогда
		КомпоновщикНастроек.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ТипДиаграммы", ТипДиаграммы.КруговаяОбъемная);
		НастройкаКруговойДиаграммы();
	КонецЕсли;
	//
	//Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	//
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	//
	//Для каждого ЭлементНастройки Из Настройки.Структура Цикл
	//
	//	Если Тип(ЭлементНастройки) = Тип("ДиаграммаКомпоновкиДанных") Тогда
	//		НастройкиДиаграммы = ЭлементНастройки;
	//		Настройки.Структура.Удалить(ЭлементНастройки);
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
КонецПроцедуры

Процедура НастройкаКруговойДиаграммы()
	
	Для каждого ЭлементНастройки Из КомпоновщикНастроек.Настройки.Структура Цикл
		
		Если ТипЗнч(ЭлементНастройки) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			
			ЭлементНастройки.Точки.Очистить();
			
			Если ТипЗнч(ЭлементНастройки.Серии) = Тип("КоллекцияЭлементовСтруктурыДиаграммыКомпоновкиДанных") Тогда
				НовыйЭлементСерия = ЭлементНастройки.Серии.Добавить();
				НовыйЭлементСерия.Использование = Истина;
				НовыйЭлементПолеСерия = НовыйЭлементСерия.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				НовыйЭлементПолеСерия.Поле = Новый ПолеКомпоновкиДанных("ВидПродукции");
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НастройкаГистограммы()
	
	Для каждого ЭлементНастройки Из КомпоновщикНастроек.Настройки.Структура Цикл
		
		Если ТипЗнч(ЭлементНастройки) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			
			ЭлементНастройки.Серии.Очистить();
			ЭлементНастройки.Точки.Очистить();
			
			Если ТипЗнч(ЭлементНастройки.Серии) = Тип("КоллекцияЭлементовСтруктурыДиаграммыКомпоновкиДанных") Тогда
				НовыйЭлементСерия = ЭлементНастройки.Серии.Добавить();
				НовыйЭлементСерия.Использование = Истина;
				НовыйЭлементПолеСерия = НовыйЭлементСерия.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				НовыйЭлементПолеСерия.Поле = Новый ПолеКомпоновкиДанных("Год");
			КонецЕсли;
			
			Если ТипЗнч(ЭлементНастройки.Точки) = Тип("КоллекцияЭлементовСтруктурыДиаграммыКомпоновкиДанных") Тогда
				НовыйЭлементТочка = ЭлементНастройки.Точки.Добавить();
				НовыйЭлементТочка.Использование = Истина;
				НовыйЭлементПолеТочка = НовыйЭлементТочка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				НовыйЭлементПолеТочка.Поле = Новый ПолеКомпоновкиДанных("ВидПродукции");
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьДиаграммуИзНастроекОтчета()
	
	Для каждого ЭлементНастройки Из КомпоновщикНастроек.Настройки.Структура Цикл
		
		Если ТипЗнч(ЭлементНастройки) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			Возврат ЭлементНастройки;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

