
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ВидДокумента") Тогда
		ВидДокумента = Параметры.Отбор.ВидДокумента;
		Если ВидДокумента = Перечисления.ВидДокументаПродажиИПроизводство.Продажи Тогда
			Заголовок = "Отчеты о Продажах";
			Элементы.Фабрика.Видимость = Ложь;
			Элементы.Фирма.Видимость = Истина;
		Иначе
			Заголовок = "Отчеты о Производстве";				
			Элементы.Фабрика.Видимость = Истина;
			Элементы.Фирма.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	ПараметрыФормы = Новый Структура("ВидДокумента", ВидДокумента);
	ОткрытьФорму("Документ.ОтчетОПродажахИПроизводстве.Форма.ФормаДокумента", ПараметрыФормы,, УникальныйИдентификатор);
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ВыбраннаяСтрока);
	ПараметрыФормы.Вставить("ВидДокумента", ВидДокумента);
	ОткрытьФорму("Документ.ОтчетОПродажахИПроизводстве.Форма.ФормаДокумента", ПараметрыФормы,
		ЭтотОбъект, ВыбраннаяСтрока);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

