#Область СлужебныеПроцедурыИФункции

Процедура СформироватьОтчетСКД(ОтчетОбъект, ДокументРезультат, ДанныеРасшифровки) Экспорт
	
	ДанныеОтчетаПериод = ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	
	ДатаНачала = ДанныеОтчетаПериод[0].Значение.ДатаНачала;
	ДатаОкончания = ДанныеОтчетаПериод[0].Значение.ДатаОкончания;
	
	Если ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.ИтогиПоПродажам") ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.ИтогиПоПроизводству") Тогда 
		ВнешнийНаборДанных = Новый Структура("ОтчетТЗ", ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства);
	Иначе	
		ТаблицаЗначенийОтчета = ИсточникДанныхСКД.ДанныеОтчета(ДатаНачала, ДатаОкончания);
		ВнешнийНаборДанных = Новый Структура("ОтчетТЗ", ТаблицаЗначенийОтчета);
    КонецЕсли;
	
	СтруктураОтчета = Новый Структура;
	СтруктураОтчета.Вставить("КомпоновщикНастроекКомпоновкиДанных", ОтчетОбъект.КомпоновщикНастроек);
	СтруктураОтчета.Вставить("СхемаКомпоновкиДанных", ОтчетОбъект.СхемаКомпоновкиДанных);
	СтруктураОтчета.Вставить("ТЗ", ТаблицаЗначенийОтчета);
	
	АдресНастроекОтчета = ПоместитьВоВременноеХранилище(СтруктураОтчета, Новый УникальныйИдентификатор());
	ПараметрыСеанса.АдресНастроек = АдресНастроекОтчета;
	
	НастройкиОтчета = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	МаксИндекс = НастройкиОтчета.Структура.Количество() - 1;
	
	Для Индекс = 0 По МаксИндекс Цикл
		Если ТипЗнч(НастройкиОтчета.Структура[МаксИндекс - Индекс]) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			НастройкиОтчета.Структура.Удалить(МаксИндекс - Индекс);
		КонецЕсли;
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ОтчетОбъект.СхемаКомпоновкиДанных, НастройкиОтчета);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных);
	
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти