#Область ОбработчикиСобытий
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистры       
	Движения.АктыКонтрагентДатаСроки.Очистить();
	Движения.АктыКонтрагентДатаСроки.Записать();
	Движения.АктыПродукцияИКод.Очистить(); 
	Движения.АктыПродукцияИКод.Записать();
	
	Движения.АктыПродукцияИКод.Записывать = Истина;
	Движения.АктыКонтрагентДатаСроки.Записывать = Истина; 	
	// регистр АктыПродукцияИКод          
	
	ДвижениеАктыПродукцияИКод = Движения.АктыПродукцияИКод.Добавить();
	ДвижениеАктыПродукцияИКод.Период = Дата;
	ДвижениеАктыПродукцияИКод.ВидПродукции = ВидПродукции;
	ДвижениеАктыПродукцияИКод.МодельПродукции = МодельПродукции;
	ДвижениеАктыПродукцияИКод.КодНеисправности = КодНеисправности;
	ДвижениеАктыПродукцияИКод.Количество = 1;
	
	// регистр АктыКонтрагентДатаСроки
	
	ДвижениеАктыКонтрагентДатаСроки = Движения.АктыКонтрагентДатаСроки.Добавить();
	ДвижениеАктыКонтрагентДатаСроки.Период = Дата;
	ДвижениеАктыКонтрагентДатаСроки.СервисныйЦентр = СервисныйЦентр;
	ДвижениеАктыКонтрагентДатаСроки.ДатаПокупки = ДатаПокупки;
	ДвижениеАктыКонтрагентДатаСроки.Количество = 1;
	Если Не ЗначениеЗаполнено(ДатаПокупки) Тогда
		СрокВДнях = 0;
	Иначе
		Если  ЗначениеЗаполнено(ДатаПокупки) Тогда
			СрокВДнях = (НачалоДня(Дата)- НачалоДня(ДатаПокупки))/8400;  
		КонецЕсли;
		ДвижениеАктыКонтрагентДатаСроки.СрокВЭксплуатации = СрокВДнях;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецЕсли	
#КонецОбласти
