#Область СлужебныеПроцедурыИФункции
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ФормированиеДиаграммОтчета(ОтчетОбъект) Экспорт
	
	Если ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.ИтогиПоВидамПродукции") Тогда
		НазваниеТочкиСерии = "ВидПродукции";
	ИначеЕсли ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.ИтогиПоВидамПродукцииПоСрокуСлужбы") Тогда
		НазваниеТочкиСерии = "КатегорияСрока";
	ИначеЕсли ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.ИтогиПоВидамЗаводскойПродукции") Тогда
		НазваниеТочкиСерии = "Фабрика";
	ИначеЕсли ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.ИтогиПоГруппамМоделей") Тогда
		НазваниеТочкиСерии = "ГруппыМоделей";
	ИначеЕсли ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.ИтогиПоГруппамМоделейПоСрокуСлужбы") Тогда
		НазваниеТочкиСерии = "КатегорияСрока";
	ИначеЕсли ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.ИтогиПоГруппамМоделейИКодовНеисправности") Тогда
		НазваниеТочкиСерии = "КодНеисправности";
	КонецЕсли;
	
	ФормированиеДиаграмм(НазваниеТочкиСерии, ОтчетОбъект);
	
КонецПроцедуры

Процедура ФормированиеДиаграмм(Знач НазваниеТочкиСерии, Знач ОтчетОбъект)
	
	ДанныеОтчетаПериод = ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	ДатаНачала = ДанныеОтчетаПериод[0].Значение.ДатаНачала;
	ДатаОкончания = ДанныеОтчетаПериод[0].Значение.ДатаОкончания;
	
	ГодНачала = Год(ДатаНачала);
	ГодОкончания = Год(ДатаОкончания);
	
	РазницаДней = (КонецДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / 86400;
	КоличествоЛетРасчет = РазницаДней / 365;
	
	Если КоличествоЛетРасчет <= 1 Тогда
		КоличествоЛет = 1;
	ИначеЕсли Окр(КоличествоЛетРасчет, 2, РежимОкругления.Окр15как20) > Цел(КоличествоЛетРасчет) Тогда
		КоличествоЛет = Цел(КоличествоЛетРасчет) + 1;
	Иначе
		КоличествоЛет = Цел(КоличествоЛетРасчет);
	КонецЕсли;
	
	ГодыОтчета = Новый Соответствие;
	ГодыОтчета.Вставить(1, ГодНачала);
	
	Для Сч = 1 По КоличествоЛет - 1 Цикл
		ОчереднойГод = ГодНачала + Сч;
		ГодыОтчета.Вставить(Сч + 1, Число(ОчереднойГод));
	КонецЦикла;
	
	Если КоличествоЛет > 1 Тогда
		ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ТипДиаграммы", ТипДиаграммы.ГистограммаОбъемная);
		ДКомпоновщик = ОтчетОбъект.КомпоновщикНастроек.Настройки;
		НастройкаГистограммы(ДКомпоновщик, НазваниеТочкиСерии);
	КонецЕсли;
	
	Если КоличествоЛет <= 1 Тогда
		ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ТипДиаграммы", ТипДиаграммы.КруговаяОбъемная);
		ДКомпоновщик = ОтчетОбъект.КомпоновщикНастроек.Настройки;
		НастройкаКруговойДиаграммы(ДКомпоновщик, НазваниеТочкиСерии);
	КонецЕсли;

КонецПроцедуры

Процедура НастройкаКруговойДиаграммы(ДКомпоновщик, НазваниеТочкиСерии = Неопределено) 
	
	Для каждого ЭлементНастройки Из ДКомпоновщик.Структура Цикл
		
		Если ТипЗнч(ЭлементНастройки) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			
			ЭлементНастройки.Серии.Очистить();
			ЭлементНастройки.Точки.Очистить();
			
			Если ТипЗнч(ЭлементНастройки.Серии) = Тип("КоллекцияЭлементовСтруктурыДиаграммыКомпоновкиДанных") Тогда
				НовыйЭлементСерия = ЭлементНастройки.Серии.Добавить();
				НовыйЭлементСерия.Использование = Истина;
				НовыйЭлементПолеСерия = НовыйЭлементСерия.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				Если НазваниеТочкиСерии <> Неопределено Тогда
					НовыйЭлементПолеСерия.Поле = Новый ПолеКомпоновкиДанных(НазваниеТочкиСерии);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НастройкаГистограммы(ДКомпоновщик, НазваниеТочкиСерии = Неопределено)
	
	Для каждого ЭлементНастройки Из ДКомпоновщик.Структура Цикл
		
		Если ТипЗнч(ЭлементНастройки) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			
			ЭлементНастройки.Серии.Очистить();
			ЭлементНастройки.Точки.Очистить();
			
			Если ТипЗнч(ЭлементНастройки.Серии) = Тип("КоллекцияЭлементовСтруктурыДиаграммыКомпоновкиДанных") Тогда
				НовыйЭлементСерия = ЭлементНастройки.Серии.Добавить();
				НовыйЭлементСерия.Использование = Истина;
				НовыйЭлементПолеСерия = НовыйЭлементСерия.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				НовыйЭлементПолеСерия.Поле = Новый ПолеКомпоновкиДанных("Год");
				НовыйЭлементПолеСерияПорядок = НовыйЭлементСерия.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
				НовыйЭлементПолеСерияПорядок.Поле = Новый ПолеКомпоновкиДанных("Год");
			КонецЕсли;
			
			Если ТипЗнч(ЭлементНастройки.Точки) = Тип("КоллекцияЭлементовСтруктурыДиаграммыКомпоновкиДанных") Тогда
				НовыйЭлементТочка = ЭлементНастройки.Точки.Добавить();
				НовыйЭлементТочка.Использование = Истина;
				Если НазваниеТочкиСерии <> Неопределено Тогда
					НовыйЭлементПолеТочки = НовыйЭлементТочка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
					НовыйЭлементПолеТочки.Поле = Новый ПолеКомпоновкиДанных(НазваниеТочкиСерии);
				КонецЕсли;
				НовыйЭлементПолеТочки = НовыйЭлементТочка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
				НовыйЭлементПолеТочки.Поле = Новый ПолеКомпоновкиДанных(НазваниеТочкиСерии);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
#КонецОбласти
