
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыОтчетаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ДиаграммаСтраница" Тогда
		
		ПроверитьСформированныйОтчет();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ПроверитьСформированныйОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьДиаграммы()
	
	ФормированиеДиаграммыНаСервере("Количество", ДиаграммаКоличество);
	ФормированиеДиаграммыНаСервере("Сумма итого", ДиаграммаЗатраты);
	ФормированиеДиаграммыНаСервере("% затрат", ДиаграммаПроцентЗатрат);
	
КонецПроцедуры

&НаСервере
Процедура ФормированиеДиаграммыНаСервере(ЗначениеВыбора, ДиаграммаОтчет)
	
	АдресНастроекОтчета = ПараметрыСеанса.АдресНастроек;
	НастройкиОтчета = ПолучитьИзВременногоХранилища(АдресНастроекОтчета);
	
	СхемаКомпоновкиДанныхОтчета = НастройкиОтчета.СхемаКомпоновкиДанных;
	НастройкиДиаграммыОтчета = НастройкиОтчета.КомпоновщикНастроекКомпоновкиДанных;
	
	ТЗ = НастройкиОтчета.ТЗ;
	ВнешнийНаборДанных = Новый Структура("ОтчетТЗ", ТЗ);
	
	НастройкиДиаграммы = НастройкиДиаграммыОтчета.ПолучитьНастройки();
	
	МаксИндекс = НастройкиДиаграммы.Структура.Количество()- 1;
	
	Для Индекс = 0 По МаксИндекс Цикл
		Если ТипЗнч(НастройкиДиаграммы.Структура[МаксИндекс-Индекс]) = Тип("ТаблицаКомпоновкиДанных") Тогда
			НастройкиДиаграммы.Структура.Удалить(МаксИндекс-Индекс);
		КонецЕсли;
	КонецЦикла;
	
	МассивЭлементовНастроек = Новый Соответствие;
	МаксИндексКоллекции = НастройкиДиаграммы.Структура.Количество() - 1;
	
	Для Каждого ЭлементСтруктуры из НастройкиДиаграммы.Структура Цикл
		ИндексДиаграммы = НастройкиДиаграммы.Структура.Индекс(ЭлементСтруктуры);
		МассивЭлементовНастроек.Вставить(ИндексДиаграммы, ЭлементСтруктуры);
	КонецЦикла;
	
	Для Каждого ЭлементСтруктуры из НастройкиДиаграммы.Структура Цикл
		
		Если Строка(ЭлементСтруктуры.Выбор) = ЗначениеВыбора Тогда
			
			ИндексДиаграммы = НастройкиДиаграммы.Структура.Индекс(ЭлементСтруктуры);
			
			Для ИндексКоллекции = 0 По МаксИндексКоллекции Цикл
				Если ИндексКоллекции <> ИндексДиаграммы Тогда
					НастройкаДиаграммыУдалить = МассивЭлементовНастроек[ИндексКоллекции];
					НастройкиДиаграммы.Структура.Удалить(НастройкаДиаграммыУдалить);
				КонецЕсли;
			КонецЦикла;
			
			ФормированиеДиаграммы(ВнешнийНаборДанных, НастройкиДиаграммы, СхемаКомпоновкиДанныхОтчета, ДиаграммаОтчет);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ФормированиеДиаграммы(ВнешнийНаборДанных, НастройкиДиаграмм, СхемаКомпоновкиДанныхОтчета, ДиаграммаОтчет)
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанныхОтчета, НастройкиДиаграмм);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных);
	
	ДиаграммаОтчет.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДиаграммаОтчет);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСформированныйОтчет(КоличествоСтрок = Неопределено)
		
	Если Результат.ВысотаТаблицы = 0 Тогда
		ПредупреждениеАсинх("Диаграммы не доступны.	
		|Сначала сформируйте отчет!");
		Возврат;
	Иначе
		СформироватьДиаграммы();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти