#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПредставлениеТекущегоВарианта = "ИтогиПоПродажам" Тогда
		Элементы.ГруппаКоличество.Заголовок = "КОЛИЧЕСТВО ПРОДАНО";
		Элементы.ГруппаЗатраты.Заголовок = "КОЛИЧЕСТВО СПИСАНО";
		Элементы.ГруппаПроцентЗатрат.Заголовок = "ПРОЦЕНТНОЕ СООТНОШЕНИЕ";
	ИначеЕсли ПредставлениеТекущегоВарианта = "ИтогиПоПроизводству" Тогда
		Элементы.ГруппаКоличество.Заголовок = "КОЛИЧЕСТВО ПРОИЗВЕДЕНО";
		Элементы.ГруппаЗатраты.Заголовок = "КОЛИЧЕСТВО РЕМОНТОВ";
		Элементы.ГруппаПроцентЗатрат.Заголовок = "ПРОЦЕНТНОЕ СООТНОШЕНИЕ";		
	КонецЕсли;   
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыОтчетаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ДиаграммаСтраница" ИЛИ ТекущаяСтраница.Имя = "ДиаграммыСписок"  Тогда
		
		ПроверитьСформированныйОтчет();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьСформированныйОтчет(КоличествоСтрок = Неопределено)
		
	Если Результат.ВысотаТаблицы = 0 Тогда
		ПредупреждениеАсинх("Диаграммы не доступны.	
		|Сначала сформируйте отчет!");
		Возврат;
	Иначе
		СформироватьДиаграммы();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьДиаграммы()

	СчетчикДиаграмм = 1;
	
	Если ПредставлениеТекущегоВарианта = "ИтогиПоПродажам" Тогда
		ФормированиеДиаграммыНаСервере("Количество продано", ДиаграммаКоличество);
		ФормированиеДиаграммыНаСервере("Количество списано", ДиаграммаЗатраты);
		ФормированиеДиаграммыНаСервере("Процентное соотношение", ДиаграммаПроцентЗатрат);
	ИначеЕсли ПредставлениеТекущегоВарианта = "ИтогиПоПроизводству" Тогда
		ФормированиеДиаграммыНаСервере("Произведено", ДиаграммаКоличество);
		ФормированиеДиаграммыНаСервере("В ремонте", ДиаграммаЗатраты);
		ФормированиеДиаграммыНаСервере("Процентное соотношение", ДиаграммаПроцентЗатрат)  
	Иначе
		ФормированиеДиаграммыНаСервере("Количество", ДиаграммаКоличество);
		ФормированиеДиаграммыНаСервере("Сумма итого", ДиаграммаЗатраты);
		ФормированиеДиаграммыНаСервере("% затрат", ДиаграммаПроцентЗатрат); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ФормированиеДиаграммыНаСервере(ЗначениеВыбора, ДиаграммаОтчет)
	
	АдресНастроекОтчета = ПараметрыСеанса.АдресНастроек;
	НастройкиОтчета = ПолучитьИзВременногоХранилища(АдресНастроекОтчета);
	
	СхемаКомпоновкиДанныхОтчета = НастройкиОтчета.СхемаКомпоновкиДанных;
	НастройкиДиаграммыОтчета = НастройкиОтчета.КомпоновщикНастроекКомпоновкиДанных;
	
	ТаблицаЗначенийОтчета = НастройкиОтчета.ТЗ;
	ВнешнийНаборДанных = Новый Структура("ОтчетТЗ", ТаблицаЗначенийОтчета);
	
	НастройкиДиаграммы = НастройкиДиаграммыОтчета.ПолучитьНастройки();
	
	МаксИндекс = НастройкиДиаграммы.Структура.Количество() - 1;
	
	Для Индекс = 0 По МаксИндекс Цикл
		Если ТипЗнч(НастройкиДиаграммы.Структура[МаксИндекс - Индекс]) = Тип("ТаблицаКомпоновкиДанных") Тогда
			НастройкиДиаграммы.Структура.Удалить(МаксИндекс - Индекс);
		КонецЕсли;
	КонецЦикла;
	
	МассивЭлементовНастроек = Новый Соответствие;
	МаксИндексКоллекции = НастройкиДиаграммы.Структура.Количество() - 1;
	
	Для Каждого ЭлементСтруктуры из НастройкиДиаграммы.Структура Цикл
		ИндексДиаграммы = НастройкиДиаграммы.Структура.Индекс(ЭлементСтруктуры);
		МассивЭлементовНастроек.Вставить(ИндексДиаграммы, ЭлементСтруктуры);
	КонецЦикла;
	
	Для Каждого ЭлементСтруктуры из НастройкиДиаграммы.Структура Цикл
		
		Если Строка(ЭлементСтруктуры.Выбор) = ЗначениеВыбора Тогда
			
			ИндексДиаграммы = НастройкиДиаграммы.Структура.Индекс(ЭлементСтруктуры);
			
			Для ИндексКоллекции = 0 По МаксИндексКоллекции Цикл
				Если ИндексКоллекции <> ИндексДиаграммы Тогда
					НастройкаДиаграммыУдалить = МассивЭлементовНастроек[ИндексКоллекции];
					НастройкиДиаграммы.Структура.Удалить(НастройкаДиаграммыУдалить);
				КонецЕсли;
			КонецЦикла;
			
			ФормированиеДиаграммы(ВнешнийНаборДанных, НастройкиДиаграммы, СхемаКомпоновкиДанныхОтчета, ДиаграммаОтчет);
			ФормированиеДиаграммыСписком(ВнешнийНаборДанных, НастройкиДиаграммы, СхемаКомпоновкиДанныхОтчета, ДиаграммаОтчет);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ФормированиеДиаграммы(ВнешнийНаборДанных, НастройкиДиаграмм, СхемаКомпоновкиДанныхОтчета, ДиаграммаОтчет)
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанныхОтчета, НастройкиДиаграмм);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных);
	
	ДиаграммаОтчет.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДиаграммаОтчет);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

&НаСервере
Процедура ФормированиеДиаграммыСписком(ВнешнийНаборДанных, НастройкиДиаграмм, СхемаКомпоновкиДанныхОтчета, ДиаграммаОтчет)
	
	ФормированиеДиаграммы(ВнешнийНаборДанных, НастройкиДиаграмм, СхемаКомпоновкиДанныхОтчета, ДиаграммаОтчет);
	
	ПромежуточныйТабДок = Новый ТабличныйДокумент;
	ПромежуточныйТабДок.Вывести(ДиаграммаОтчет);
	
	ВысотаДиаграммы = ПромежуточныйТабДок.ВысотаТаблицы;
	
	Если СчетчикДиаграмм = 1 Тогда
		ДиаграммаСводная.Очистить();
		ЗаголовокДиаграммы = ДиаграммаСводная.Область("R1C1");
		ЗаголовокДиаграммы.Текст = Элементы.ГруппаКоличество.Заголовок;
		ЗаголовокДиаграммы.Шрифт = ШрифтыСтиля.ШрифтЗаголовкаОтчетов;
		ЗаголовокДиаграммы.ЦветТекста = ЦветаСтиля.ЦветШрифтаНазванияДиаграммы;
		ДиаграммаСводная.Вывести(ПромежуточныйТабДок);
	ИначеЕсли СчетчикДиаграмм = 2 Тогда
		ЗаголовокДиаграммы = ДиаграммаСводная.Область(СтрШаблон("R%1C1", ВысотаДиаграммы + 2));
		ЗаголовокДиаграммы.Текст = Элементы.ГруппаЗатраты.Заголовок;
		ЗаголовокДиаграммы.Шрифт = ШрифтыСтиля.ШрифтЗаголовкаОтчетов;
		ЗаголовокДиаграммы.ЦветТекста = ЦветаСтиля.ЦветШрифтаНазванияДиаграммы;
		ДиаграммаСводная.Вывести(ПромежуточныйТабДок);
	ИначеЕсли СчетчикДиаграмм = 3 Тогда
		ЗаголовокДиаграммы = ДиаграммаСводная.Область(СтрШаблон("R%1C1", 2 * ВысотаДиаграммы + 2));
		ЗаголовокДиаграммы.Текст = Элементы.ГруппаПроцентЗатрат.Заголовок;
		ЗаголовокДиаграммы.Шрифт = ШрифтыСтиля.ШрифтЗаголовкаОтчетов;
		ЗаголовокДиаграммы.ЦветТекста = ЦветаСтиля.ЦветШрифтаНазванияДиаграммы;
		ДиаграммаСводная.Вывести(ПромежуточныйТабДок);
	КонецЕсли;
	
	СчетчикДиаграмм = СчетчикДиаграмм + 1;
	
КонецПроцедуры

#КонецОбласти