
#Область ОбработчикиСобытийЭлементовШапкиФормы	

&НаКлиенте 
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    
    ПараметрыФайла  = Новый Структура;
    ПараметрыФайла .Вставить("ИдентификаторФормы", УникальныйИдентификатор);
    
    Результат = Ждать РаботаСФайломКлиент.ВыбратьФайл(ПараметрыФайла);
    
    Если Результат.ФайлВыбран Тогда
        Объект.ПутьКФайлу = Результат.ПутьКФайлу;
    Иначе
        ПоказатьПредупреждение(,"Файл не выбран");
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы	

&НаКлиенте   
Процедура Загрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Выберите файл для загрузки");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере();
	ПоказатьОповещениеПользователя("Строк в таблице: " + Объект.ТаблицаЗагрузки.Количество());;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ТаблицаЗагрузки) Тогда
		ПоказатьПредупреждение(, "Загрузите файл в таблицу");
		Возврат;
	КонецЕсли; 
	
	СохранитьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере() 
	
	ТабЗнач = РаботаСCSVСервер.ПрочитатьФайлCSV(Объект.ПутьКФайлу);

	РаботаСФормамиСервер.ОбновитьДинамическуюТаблицу(ЭтотОбъект, "Объект.ТаблицаЗагрузки", "ТЗ","ДанныеЗагрузки", ТабЗнач);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	СозданоЭлементов = 0;
	ТаблицаЗначений = Объект.ТаблицаЗагрузки.Выгрузить();

	// 1. Собираем все уникальные сервисные центры для поиска
	СервисныеЦентры = Новый Массив;
	Для каждого СтрокаДанных из ТаблицаЗначений Цикл
		Если СервисныеЦентры.Найти(СтрокаДанных.service_center_id) = Неопределено Тогда  
			СервисныеЦентры.Добавить(СтрокаДанных.service_center_id);
			Если СтрокаДанных.service_center_id = "" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	// 2. Получаем соответствие IDСайта -> Ссылка на контрагента
	СоответствиеКонтрагента = СоответствияСервер.ПолучитьСоответствиеКонтрагентов(СервисныеЦентры);
    СоответствиеСуществующихКонтактов = СоответствияСервер.ПолучитьСоответствиеКонтактныхЛиц(СервисныеЦентры);
	
	Для каждого СтрокаДанных из ТаблицаЗначений Цикл 
		
			// 3. Проверяем, существует ли уже контрагент с таким IDСайта
		Если СоответствиеСуществующихКонтактов[Число(СтрокаДанных.id)] <> Неопределено Тогда
			// 4. Контрагент уже существует, пропускаем создание
			Продолжить;			
		КонецЕсли; 
		
		// 5. Создание табличной части у справочника Контрагенты
		//  6. Устанавливаем контрагента по соответствию
		Если СтрокаДанных.service_center_id <> Неопределено Тогда
			ЧислоID= Число(СтрокаДанных.service_center_id);
			СсылкаНаКонтрагента = СоответствиеКонтрагента[ЧислоID];
			Если СсылкаНаКонтрагента <> Неопределено Тогда
				КонтрагентОбъект = СсылкаНаКонтрагента.ПолучитьОбъект(); 
				КонтактнаяИнформация = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
				КонтактнаяИнформация.IDСайта = СтрокаДанных.id;
				КонтактнаяИнформация.ФИО = СтрокаДанных.name;
				КонтактнаяИнформация.Телефон = СтрокаДанных.tel_num;
				КонтактнаяИнформация.Email = СтрокаДанных.email;
				КонтактнаяИнформация.Примечание = СтрокаДанных.note;
				КонтрагентОбъект.Записать();
			КонецЕсли; 
		КонецЕсли; 
		
		// 7. Создание элемента справочника Контакты контрагентов
		НовыйЭлемент = Справочники.КонтактыКонтрагентов.СоздатьЭлемент();
		// 8. Устанавливаем контрагента по соответствию
		Если СтрокаДанных.service_center_id <> Неопределено Тогда
			ЧислоID= Число(СтрокаДанных.service_center_id);
			СсылкаНаКонтрагента = СоответствиеКонтрагента[ЧислоID];
			Если СсылкаНаКонтрагента <> Неопределено Тогда
				НовыйЭлемент.Владелец = СсылкаНаКонтрагента;
			КонецЕсли;
		Иначе
			НовыйЭлемент.Владелец = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		НовыйЭлемент.IDСайта = СтрокаДанных.id;
		НовыйЭлемент.Наименование = СтрокаДанных.name;
		НовыйЭлемент.Телефон = СтрокаДанных.tel_num;
		НовыйЭлемент.Email = СтрокаДанных.email;  
		НовыйЭлемент.Комментарий = СтрокаДанных.note;
		НовыйЭлемент.Записать(); 
		СозданоЭлементов = СозданоЭлементов + 1; 
		
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю; 
	Текст = СтрШаблон("Загружено и создано %1 элементов справочника", СозданоЭлементов);
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти

