
#Область ОбработчикиКомандФормы

&НаКлиенте 
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    
    ПараметрыФайла  = Новый Структура;
    ПараметрыФайла .Вставить("ИдентификаторФормы", УникальныйИдентификатор);
    
    Результат = Ждать РаботаСФайломКлиент.ВыбратьФайл(ПараметрыФайла);
    
    Если Результат.ФайлВыбран Тогда
        Объект.ПутьКФайлу = Результат.ПутьКФайлу;
    Иначе
        ПоказатьПредупреждение(,"Файл не выбран");
    КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте   
Процедура Загрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Выберите файл для загрузки");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере();
	Сообщить("Строк в таблице: " + Объект.ТаблицаЗагрузки.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ТаблицаЗагрузки) Тогда
		ПоказатьПредупреждение(, "Загрузите файл в таблицу");
		Возврат;
	КонецЕсли; 
	
	СохранитьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере() 
	
	ТЗ = РаботаСCSVСервер.ПрочитатьФайлCSV(Объект.ПутьКФайлу);

	РаботаСФормамиСервер.ОбновитьДинамическуюТаблицу(ЭтаФорма, "Объект.ТаблицаЗагрузки", "ТЗ","ДанныеЗагрузки", ТЗ);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	СозданоЭлементов = 0;
	ТаблицаДанных = Объект.ТаблицаЗагрузки.Выгрузить();
	КоличествоСтрокВТаблице = ТаблицаДанных.Количество();
	Для каждого СтрокаДанных из ТаблицаДанных Цикл
		НовыйЭлемент = Справочники.ВидыПродукции.СоздатьЭлемент();
		НовыйЭлемент.IDСайта = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.id);
		НовыйЭлемент.Наименование = СтрокаДанных.title;
		НовыйЭлемент.КраткоеНаименование = СтрокаДанных.short_title;
		НовыйЭлемент.Записать();
		СозданоЭлементов = СозданоЭлементов + 1;
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю; 
	Текст = СтрШаблон("В Таблице содержится %1 строк.
						|Загружено и создано %2 элементов справочника", КоличествоСтрокВТаблице, СозданоЭлементов);
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

КонецПроцедуры


#КонецОбласти

