
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВыбораМесяца(Элементы.НачалоПериода.Имя, ТекущаяУниверсальнаяДата());
	ЗаполнитьСписокВыбораМесяца(Элементы.КонецПериода.Имя, ТекущаяУниверсальнаяДата());
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Товары.Очистить();
	
	// Переписываем данные из ТаблицыФорма в реквизит Документа
	КолонкиТаблицы = ТаблицаФормы.Выгрузить().Колонки;
    Префикс = ПолучитьПрефиксРеквизита();
    Для Каждого СтрокаДанных Из ТаблицаФормы Цикл
    	Если Не ЗначениеЗаполнено(СтрокаДанных.Модель) Тогда
    		Продолжить;
    	КонецЕсли;
        Для Каждого Колонка Из КолонкиТаблицы Цикл
            ИмяКолонки = Колонка.Имя;
            Значение   = СтрокаДанных[ИмяКолонки];
            Если СтрНачинаетсяС(ИмяКолонки, Префикс) Тогда
            	Инд = СтрНайти(ИмяКолонки, "_");
            	Если Инд > 0 Тогда
            		НоваяСтрока = ТекущийОбъект.Товары.Добавить();
    				НоваяСтрока.Номенклатура = СтрокаДанных.Модель;
    				НоваяСтрока.ВидПродукции = СтрокаДанных.ВидПродукции;
                	МесяцСтрока = Сред(ИмяКолонки, Инд + 1);
                	НоваяСтрока.МесяцПродаж = Дата(МесяцСтрока);
                	НоваяСтрока.Количество = Число(Значение);
                КонецЕсли;
            КонецЕсли;      
        КонецЦикла;    
    КонецЦикла;
   	ТекущийОбъект.Товары.Свернуть("Номенклатура,МесяцПродаж,ВидПродукции", "Количество");
   	
   	// Получаем списко видов продукции без повторений
   	ТаблицаВидовПродукции = ТекущийОбъект.Товары.Выгрузить( , "ВидПродукции");
   	ТаблицаВидовПродукции.Свернуть("ВидПродукции");
   	МассивВидовПродукции = ТаблицаВидовПродукции.ВыгрузитьКолонку("ВидПродукции");
   	ТекущийОбъект.СписокВидовПродукции = СтрСоединить(МассивВидовПродукции, ", ");
   
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Создаем структуру таблицы
	ИзменитьТабличнуюЧасть();
	
	// Получаем соответствие дат начала месяца и имен колонок
	СоответствиеДатИКолонок = ПолучитьСоответствиеДатИКолонок();
	
	// Загружаем данные из реквизита Документа в ТаблицуФормы
	Для Каждого Товар Из ТекущийОбъект.Товары Цикл
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Модель", Товар.Номенклатура);
		МассивСтрок = ТаблицаФормы.НайтиСтроки(ПараметрыПоиска);
		Если МассивСтрок.Количество() = 0 Тогда
			СтрокаТаблицыФормы = ТаблицаФормы.Добавить();
			СтрокаТаблицыФормы.Модель = Товар.Номенклатура;
			СтрокаТаблицыФормы.ВидПродукции = Товар.ВидПродукции;
		Иначе
			СтрокаТаблицыФормы = МассивСтрок[0];		
		КонецЕсли;
		// Ищем колонку в соответствии
		ИмяКолонки = СоответствиеДатИКолонок.Получить(Товар.МесяцПродаж);
		Если ИмяКолонки <> Неопределено Тогда
			СтрокаТаблицыФормы[ИмяКолонки] = Товар.Количество;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	Если Объект.НачалоПериода > Объект.КонецПериода Тогда
		Объект.КонецПериода = Объект.НачалоПериода;
	КонецЕсли;
	ИзменитьТабличнуюЧасть();
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	Если Объект.КонецПериода < Объект.НачалоПериода Тогда
		Объект.НачалоПериода = Объект.КонецПериода;
	КонецЕсли;
	ИзменитьТабличнуюЧасть();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаФормы

&НаКлиенте
Процедура ТаблицаФормыМодельПриИзменении(Элемент)
	ТекущаяСтрокаДанных = Элементы.ТаблицаФормы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрокаДанных.Модель) Тогда
		ТекущаяСтрокаДанных.ВидПродукции = ПолучитьВидПродукции(ТекущаяСтрокаДанных.Модель);
	Иначе
		ТекущаяСтрокаДанных.ВидПродукции = ПредопределенноеЗначение("Справочник.ВидыПродукции.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПрефиксРеквизита()
	Возврат "tmp";
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораМесяца(ИмяЭлемента, МаксДата)
	ПолеВвода = Элементы.Найти(ИмяЭлемента);
	Если ПолеВвода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеВвода.СписокВыбора.Очистить();	
	МаксГод = Год(МаксДата);
	Для СчГод = 0 По 5 Цикл
		ТекГод = МаксГод - СчГод;
		МаксМесяц = ?(ТекГод < МаксГод, 12, Месяц(МаксДата));
		Для СчМесяц = 0 По МаксМесяц - 1 Цикл
			ТекДата = Дата(ТекГод, МаксМесяц - СчМесяц, 1);
			ПолеВвода.СписокВыбора.Добавить(ТекДата, Формат(ТекДата, "ДФ='MMMM yyyy';"));
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ИзменитьТабличнуюЧасть()
	Если Объект.КонецПериода < Объект.НачалоПериода Тогда
		ВызватьИсключение "Конец периода меньше начала периода!";
	КонецЕсли;
	
	// Удаляем ранее добавленные элементы и реквизиты по префиксу
	УдалитьПрограммноДобавленыеЭлементыИРеквизиты();
	
	// Подготавливаем списко добавляемых колонок
	КоличествоКолонок = (Месяц(Объект.КонецПериода) - Месяц(Объект.НачалоПериода))	
		+ (Год(Объект.КонецПериода) - Год(Объект.НачалоПериода)) * 12 + 1;
	СписокКолонок = Новый Массив;
	ТекМесяц = НачалоМесяца(Объект.НачалоПериода);
	Префикс = ПолучитьПрефиксРеквизита();
	Для Сч = 1 По КоличествоКолонок Цикл
		НоваяКолонка = Новый Структура();
		ИмяКолонки = СтрШаблон("%1%2_%3", Префикс, НумераторРеквизитов, Формат(ТекМесяц, "ДФ=yyyyMMdd;"));
		НоваяКолонка.Вставить("Имя", ИмяКолонки);
		НоваяКолонка.Вставить("Заголовок", Формат(ТекМесяц, "ДФ='MMMM yyyy';"));
		СписокКолонок.Добавить(НоваяКолонка);	
		ТекМесяц = НачалоМесяца(ДобавитьМесяц(ТекМесяц, 1));
	КонецЦикла;
	
	// Добавляем реквизиты формы	
	ДобавляемыеРеквизиты = Новый Массив;
	КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный);
    ОписаниеТипаКолонки = Новый ОписаниеТипов("Число",  КвалификаторыЧисла);
	Для Каждого НоваяКолонка Из СписокКолонок Цикл
		НовыйРеквизит = Новый РеквизитФормы(НоваяКолонка.Имя, ОписаниеТипаКолонки,
			"ТаблицаФормы", НоваяКолонка.Заголовок);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавляем элементы формы
	Для Каждого НоваяКолонка Из СписокКолонок Цикл
		ЭлементКолонка = Элементы.Добавить(НоваяКолонка.Имя, Тип("ПолеФормы"),
			Элементы["ТаблицаФормы"]);
		ЭлементКолонка.Заголовок = НоваяКолонка.Заголовок;
    	ЭлементКолонка.ПутьКДанным = "ТаблицаФормы." + НоваяКолонка.Имя;
    	ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
	КонецЦикла;
	
	// Добавляем пустую колонку в конце для красоты таблицы
	ДобавитьПустоеПолеВТабличнуюЧасть();
	
	// Увеличиваем позицию нумератора
	НумераторРеквизитов = НумераторРеквизитов  + 1;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПустоеПолеВТабличнуюЧасть()
	// Добавляем реквизит формы	
	ИмяКолонки = СтрШаблон("%1%2%3", ПолучитьПрефиксРеквизита(), НумераторРеквизитов, "decoration");
	ДобавляемыеРеквизиты = Новый Массив;
    ОписаниеТипаКолонки = Новый ОписаниеТипов("Строка",  Новый КвалификаторыСтроки(10));
	НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, ОписаниеТипаКолонки,
		"ТаблицаФормы");
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавляем элементы формы
	ЭлементКолонка = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"),
		Элементы["ТаблицаФормы"]);
	ЭлементКолонка.Заголовок = Символ(32);
	ЭлементКолонка.ТолькоПросмотр = Истина;
    ЭлементКолонка.ПутьКДанным = "ТаблицаФормы." + ИмяКолонки;
    ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПрограммноДобавленыеЭлементыИРеквизиты()
	Префикс = ПолучитьПрефиксРеквизита();
	
	// Удаляем элементы Формы	
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого ЭлементФормы Из Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") И СтрНачинаетсяС(ЭлементФормы.Имя, Префикс) Тогда
			УдаляемыеЭлементы.Добавить(ЭлементФормы);
		КонецЕсли
	КонецЦикла;
	Для Каждого ЭлементФормы Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(ЭлементФормы);
	КонецЦикла;
	
	// Удаляем реквизиты
	РеквизитыФормы = ПолучитьРеквизиты();
	УдаляемыеРеквизиты = Новый Массив;
	Для Каждого РевизитФормы Из РеквизитыФормы Цикл
		Если СтрНачинаетсяС(РевизитФормы.Имя, Префикс) Тогда
			УдаляемыеРеквизиты.Добавить(РевизитФормы);
		КонецЕсли
	КонецЦикла;
	Если УдаляемыеРеквизиты.Количество() > 0 Тогда
        ИзменитьРеквизиты( , УдаляемыеРеквизиты);
    КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидПродукции(МодельСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Ссылка.ВидПродукции КАК ВидПродукции
		|ИЗ
		|	Справочник.МоделиПродукции КАК МоделиПродукции
		|ГДЕ
		|	Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", МодельСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	    Возврат Выборка.ВидПродукции;
	КонецЕсли;
	
	Возврат Справочники.ВидыПродукции.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеДатИКолонок()
	КолонкиТаблицы = ТаблицаФормы.Выгрузить().Колонки;	
	СоответствиеДат = Новый Соответствие;
	
	МесяцТек = Объект.НачалоПериода;
	Пока МесяцТек <= Объект.КонецПериода Цикл
		МесяцСтрока = Формат(МесяцТек, "ДФ=yyyyMMdd;");
		Для Каждого Колонка Из КолонкиТаблицы Цикл
            ИмяКолонки = Колонка.Имя;
            Если СтрНайти(ИмяКолонки,МесяцСтрока) > 0 Тогда
            	СоответствиеДат.Вставить(МесяцТек, ИмяКолонки);	
            КонецЕсли;      
		КонецЦикла;	
		МесяцТек = ДобавитьМесяц(МесяцТек, 1);
	КонецЦикла;
	
	Возврат СоответствиеДат;
	
КонецФункции

#КонецОбласти



