
Функция ПолучитьСоответствиеДокументаАкт_НРП(МассивID) Экспорт
	
	Соответствие = Новый Соответствие;
	
	МассивЧисел = МассивЧиселID(МассивID, Соответствие);
	
	// Запрос для поиска кодов по IDСайта
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктНРП.Ссылка КАК Ссылка,
	|	АктНРП.IDСайта КАК IDСайта
	|ИЗ
	|	Документ.АктНРП КАК АктНРП
	|ГДЕ
	|	АктНРП.IDСайта В (&МассивID)";
	
	Запрос.УстановитьПараметр("МассивID", МассивЧисел);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// Заполняем соответствие
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.IDСайта, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьСервисныеЦентры(МассивID) Экспорт
	
	Соответствие = Новый Соответствие; 
	МассивЧисел = МассивЧиселID(МассивID, Соответствие);

	
	// Запрос для поиска сервисного центра
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.IDСайта КАК IDСайта
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.IDСайта В(&МассивID)";
	
	Запрос.УстановитьПараметр("МассивID", МассивЧисел);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// Заполняем соответствие
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.IDСайта, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции 

Функция ПолучитьСоответствиеДокументаРемонт(МассивID) Экспорт
	
	Соответствие = Новый Соответствие;
	
	МассивЧисел = МассивЧиселID(МассивID, Соответствие);
	
	// Запрос для поиска кодов по IDСайта
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ремонт.Ссылка КАК Ссылка,
	|	Ремонт.IDСайта КАК IDСайта
	|ИЗ
	|	Документ.Ремонт КАК Ремонт
	|ГДЕ
	|	Ремонт.IDСайта В(&МассивID)";
	
	Запрос.УстановитьПараметр("МассивID", МассивЧисел);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// Заполняем соответствие
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.IDСайта, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьСоответствиеДокументаРемонтПоОтчету(МассивID) Экспорт
	
	Соответствие = Новый Соответствие;
	
	МассивЧисел = МассивЧиселID(МассивID, Соответствие);
	
	// Запрос для поиска кодов по IDСайта
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ремонт.Ссылка КАК Ссылка,
	|	Ремонт.КодОтчета КАК КодОтчета
	|ИЗ
	|	Документ.Ремонт КАК Ремонт
	|ГДЕ
	|	Ремонт.КодОтчета В(&МассивID)";
	
	Запрос.УстановитьПараметр("МассивID", МассивЧисел);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// Заполняем соответствие
	Пока Выборка.Следующий() Цикл
		Ключ = Выборка.КодОтчета;
		Значение = Выборка.Ссылка;
		
		Если Соответствие[Ключ] = Неопределено Тогда
			// Создаём массив для этого ключа
			МассивСсылок = Новый Массив;
			МассивСсылок.Добавить(Значение);
			Соответствие.Вставить(Ключ, МассивСсылок);
		Иначе
			// Добавляем в существующий массив
			МассивСсылок = Соответствие[Ключ];
			МассивСсылок.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьПроизводитей(СимвольныйКод) Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Запрос для поиска производителей
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФабрикиИСмены.СимвольныйКод КАК СимвольныйКод,
	|	ФабрикиИСмены.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФабрикиИСмены КАК ФабрикиИСмены
	|ГДЕ
	|	ФабрикиИСмены.СимвольныйКод В(&СимвольныйКод)
	|	И ФабрикиИСмены.ЭтоГруппа = ИСТИНА";
	
	Запрос.УстановитьПараметр("СимвольныйКод", СимвольныйКод);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// Заполняем соответствие
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.СимвольныйКод, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции 

Функция ПолучитьПроизводственныеСмены(КодыСмен, КодыПроизводителей) Экспорт
	
	Соответствие = Новый Соответствие;
	
	Если КодыСмен = Неопределено ИЛИ КодыСмен.Количество() = 0 
		ИЛИ КодыПроизводителей = Неопределено ИЛИ КодыПроизводителей.Количество() = 0 Тогда
		Возврат Соответствие;
	КонецЕсли;
	
	// Запрос для поиска производителей
	Запрос = Новый Запрос;
	Запрос.Текст = 
    "ВЫБРАТЬ
    |	ФабрикиИСмены.СимвольныйКод КАК СимвольныйКод,
    |	ФабрикиИСмены.Ссылка КАК Ссылка,
    |	ФабрикиИСмены.Родитель.СимвольныйКод КАК КодПроизводителя
    |ИЗ
    |	Справочник.ФабрикиИСмены КАК ФабрикиИСмены
    |ГДЕ
    |	ФабрикиИСмены.СимвольныйКод В(&КодыСмен)
    |	И НЕ ФабрикиИСмены.ЭтоГруппа
    |	И ФабрикиИСмены.Родитель.ЭтоГруппа = ИСТИНА
    |	И ФабрикиИСмены.Родитель.СимвольныйКод В(&КодыПроизводителей)";	
	
	Запрос.УстановитьПараметр("КодыСмен", КодыСмен);
    Запрос.УстановитьПараметр("КодыПроизводителей", КодыПроизводителей);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        Ключ = Выборка.КодПроизводителя + "|" + Выборка.СимвольныйКод;
		Соответствие.Вставить(Ключ, Выборка.Ссылка);
	КонецЦикла;  
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьСоответствиеРегионов(МассивID) Экспорт
	
	Соответствие = Новый Соответствие;
	
	МассивЧисел = МассивЧиселID(МассивID, Соответствие);
		
	// Запрос для поиска регионов по IDСайта
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегионыСервиса.Ссылка КАК Ссылка,
	|	РегионыСервиса.IDСайта КАК IDСайта
	|ИЗ
	|	Справочник.РегионыСервиса КАК РегионыСервиса
	|ГДЕ
	|	РегионыСервиса.IDСайта В(&МассивID)";
	
	Запрос.УстановитьПараметр("МассивID", МассивЧисел);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// Заполняем соответствие
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.IDСайта, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьСтатусыОтчета(МассивНаименований) Экспорт
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить("draft", Перечисления.СтатусыОтчета.Черновик);
	Соответствие.Вставить("send", Перечисления.СтатусыОтчета.ОтправленНаПроверку);
	Соответствие.Вставить("refinement", Перечисления.СтатусыОтчета.НаДоработке);
	Соответствие.Вставить("send_again", Перечисления.СтатусыОтчета.ОтправленПовторно);
	Соответствие.Вставить("received", Перечисления.СтатусыОтчета.ПринятНаПроверку);
	Соответствие.Вставить("verified", Перечисления.СтатусыОтчета.ПроверенМенеджером);
	Соответствие.Вставить("accepted", Перечисления.СтатусыОтчета.ПринятУтвержден);
	Соответствие.Вставить("payment", Перечисления.СтатусыОтчета.Оплачен); 
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьСоответствиеКонтрагентов(МассивID) Экспорт
	
	Соответствие = Новый Соответствие;
	
	МассивЧисел = Новый Массив;
	Для Каждого СтрокаID Из МассивID Цикл
		Попытка
			// Пробуем преобразовать строку в число
			ЧислоЗначение = Число(СтрокаID);
			МассивЧисел.Добавить(ЧислоЗначение);
		Исключение
			// Если не удалось преобразовать, логируем ошибку
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось преобразовать значение в число: " + СтрокаID;
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;		
	// Если нет ID для поиска, возвращаем пустое соответствие
	Если МассивЧисел.Количество() = 0 Тогда
		Возврат Соответствие;
	КонецЕсли;
	
	// Запрос для поиска контрагентов по IDСайта
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.IDСайта КАК IDСайта
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.IDСайта В(&МассивID)";
	
	Запрос.УстановитьПараметр("МассивID", МассивЧисел);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// Заполняем соответствие
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.IDСайта, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьСоответствиеКонтактныхЛиц(МассивID) Экспорт
	
	Соответствие = Новый Соответствие;
	
	МассивЧисел = Новый Массив;
	Для Каждого СтрокаID Из МассивID Цикл
		Попытка
			// Пробуем преобразовать строку в число
			ЧислоЗначение = Число(СтрокаID);
			МассивЧисел.Добавить(ЧислоЗначение);
		Исключение
			// Если не удалось преобразовать, логируем ошибку
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось преобразовать значение в число: " + СтрокаID;
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;		
	// Если нет ID для поиска, возвращаем пустое соответствие
	Если МассивЧисел.Количество() = 0 Тогда
		Возврат Соответствие;
	КонецЕсли;
	
	// Запрос для поиска конт.лиц по IDСайта
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактыКонтрагентов.Ссылка КАК Ссылка,
	|	КонтактыКонтрагентов.IDСайта КАК IDСайта
	|ИЗ
	|	Справочник.КонтактыКонтрагентов КАК КонтактыКонтрагентов
	|ГДЕ
	|	КонтактыКонтрагентов.IDСайта В(&МассивID)";
	
	Запрос.УстановитьПараметр("МассивID", МассивЧисел);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// Заполняем соответствие
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.IDСайта, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьСоответствиеДокументовОтчетовОРемонтах(МассивID) Экспорт
	
	Соответствие = Новый Соответствие;
	
	МассивЧисел = МассивЧиселID(МассивID, Соответствие);
	
	// Запрос для поиска  по IDСайта
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтчетОРемонтах.IDСайта КАК IDСайта,
	               |	ОтчетОРемонтах.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ОтчетОРемонтах КАК ОтчетОРемонтах
	               |ГДЕ
	               |	ОтчетОРемонтах.IDСайта В(&МассивID)";
	
	Запрос.УстановитьПараметр("МассивID", МассивЧисел);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.IDСайта, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьСоответствиеВидовПродукцииОбщая(Массив, ВозвращатьНаименование = Ложь) Экспорт

    Соответствие = Новый Соответствие;
    
    МассивЧисел = МассивЧиселID(Массив, Соответствие);
    
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	ВидыПродукции.Ссылка КАК Ссылка,
                   |	ВидыПродукции.IDСайта КАК IDСайта,
                   |	ВидыПродукции.Наименование КАК Наименование
                   |ИЗ
                   |	Справочник.ВидыПродукции КАК ВидыПродукции
                   |ГДЕ
                   |	ВидыПродукции.IDСайта В(&Массив)";
    
    Запрос.УстановитьПараметр("Массив", МассивЧисел);
    Выборка = Запрос.Выполнить().Выбрать();
	
    // Заполнение соответствия в зависимости от параметра
    Пока Выборка.Следующий() Цикл
        Если ВозвращатьНаименование Тогда
            Значение = Выборка.Наименование;
        Иначе
            Значение = Выборка.Ссылка;
        КонецЕсли;
        Соответствие.Вставить(Выборка.IDСайта, Значение);
    КонецЦикла;
    
    Возврат Соответствие;
    
КонецФункции

Функция ПолучитьСоответствиеКодовНеисправностей(МассивID) Экспорт
	
	Соответствие = Новый Соответствие;
	
	МассивЧисел = МассивЧиселID(МассивID, Соответствие);
	
	// Запрос для поиска кодов по IDСайта
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КодыНеисправностей.Ссылка КАК Ссылка,
	|	КодыНеисправностей.IDСайта КАК IDСайта
	|ИЗ
	|	Справочник.КодыНеисправностей КАК КодыНеисправностей
	|ГДЕ
	|	КодыНеисправностей.IDСайта В(&МассивID)";
	
	Запрос.УстановитьПараметр("МассивID", МассивЧисел);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// Заполняем соответствие
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.IDСайта, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьСоответствиеНоменклатуры(МассивЗначений, ПоИдентификаторам = Истина, ВозвращатьНаименование = Ложь) Экспорт

    Соответствие = Новый Соответствие;
    
    // Подготовка массива значений для запроса
    Если ПоИдентификаторам Тогда
        МассивДляЗапроса = МассивЧиселID(МассивЗначений, Соответствие);
    Иначе
        МассивДляЗапроса = МассивЗначений;
    КонецЕсли;
    
    Если МассивДляЗапроса.Количество() = 0 Тогда
        Возврат Соответствие;
    КонецЕсли;
    
    // Определяем поля в зависимости от режимов
    Если ПоИдентификаторам Тогда
        ПолеПоиска = "IDСайта";
        Если ВозвращатьНаименование Тогда
            ПолеЗначения = "Наименование";
        Иначе
            ПолеЗначения = "Ссылка";
        КонецЕсли;
    Иначе
        ПолеПоиска = "Наименование";
        ПолеЗначения = "Ссылка"; 
	КонецЕсли;
    
 	Запрос = Новый Запрос;
	Запрос.Текст = 
    "ВЫБРАТЬ
    |    МоделиПродукции.%1 КАК Значение,
    |    МоделиПродукции.%2 КАК Ключ
    |ИЗ
    |    Справочник.МоделиПродукции КАК МоделиПродукции
    |ГДЕ
    |    МоделиПродукции.%3 В (&МассивДляЗапроса)";
    
    ТекстЗапроса = СтрЗаменить(Запрос.Текст, "%1", ПолеЗначения);
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%2", ПолеПоиска);
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%3", ПолеПоиска);
    
    Запрос = Новый Запрос;
    Запрос.Текст = ТекстЗапроса;
    Запрос.УстановитьПараметр("МассивДляЗапроса", МассивДляЗапроса);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        Соответствие.Вставить(Выборка.Ключ, Выборка.Значение);
    КонецЦикла;
    
    Возврат Соответствие; 
КонецФункции

Функция ПолучитьСоответствиеГруппКодовНеисправностей(МассивНаименований) Экспорт
	
	Соответствие = Новый Соответствие;
	
	// Запрос для поиска кодов по IDСайта
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КодыНеисправностей.Ссылка КАК Ссылка,
	|	КодыНеисправностей.IDСайта КАК IDСайта,
	|	КодыНеисправностей.Наименование КАК Наименование
	|ИЗ
	|	Справочник.КодыНеисправностей КАК КодыНеисправностей
	|ГДЕ
	|	КодыНеисправностей.IDСайта В(&МассивНаименований)";
	
	Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// Заполняем соответствие
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

// Общая функция для текущего модуля
Функция МассивЧиселID(МассивID, Соответствие)
	
	МассивЧисел = Новый Массив;
	
	Для Каждого СтрокаID Из МассивID Цикл
		Попытка
			// Пробуем преобразовать строку в число
			ЧислоЗначение = Число(СтрокаID);
			МассивЧисел.Добавить(ЧислоЗначение);
		Исключение
			// Если не удалось преобразовать, логируем ошибку
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось преобразовать значение в число: " + СтрокаID;
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;		
	// Если нет ID для поиска, возвращаем пустое соответствие
	Если МассивЧисел.Количество() = 0 Тогда
		Возврат Соответствие;
	Иначе
		Возврат МассивЧисел;
	КонецЕсли;
	
КонецФункции

