&НаКлиенте
Процедура СтраницыОтчетаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.Диаграмма Тогда 
		
		РРР = Результат.Рисунки;
		//Результат.Рисунки.Очистить();
		ВывестиДиаграмму(РРР);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВывестиДиаграмму(РРР)
	
	ОбластьДиаграммы = Диаграммы.Область(1, 1);
	
	Для Каждого РисунокДиаграммы Из РРР Цикл
		
		НовыйРисунок = Диаграммы.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Диаграмма);
		НовыйРисунок.Расположить(ОбластьДиаграммы);
		НовыйРисунок.Картинка = РисунокДиаграммы.Картинка;
	КонецЦикла;
		
КонецПроцедуры

Процедура СформироватьТЗ()
	
	КоличествоСтрок = Результат.ВысотаТаблицы;
	КоличествоКолонок = Результат.ШиринаТаблицы;
	
	СтрокиТаблицы = Новый Массив;
	КолонкиТаблицы = Новый Соответствие;
	
	Для Строка = 4 По КоличествоСтрок Цикл
		
		Если Результат.Область(Строка, 1).Текст = "Итого" Тогда
			Продолжить;
		Иначе
			КолонкиТаблицы = Новый Соответствие;
			Для Колонка = 1 По КоличествоКолонок Цикл
				КолонкиТаблицы.Вставить(Колонка, Результат.Область(Строка, Колонка).Текст);
			КонецЦикла;
				СтрокиТаблицы.Добавить(КолонкиТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	
	
	ТЗ = Новый ТаблицаЗначений;
	
	
КонецПроцедуры