
#Область ОбработчикиСобытийЭлементовТаблицыФормыМодельПродукции

&НаКлиенте
Процедура МодельПродукцииПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
		ПоказатьПредупреждение(,"Для выбора модели необходимо выбрать вид продукции");	
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МодельПродукцииПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.МодельПродукции.ТекущиеДанные;	
	Если ТекущаяСтрока = Неопределено Тогда
		Элемент.ЗакончитьРедактированиеСтроки(Истина);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПроверитьНаличиеДубля(ТекущаяСтрока) Тогда		
		ПоказатьПредупреждение(,СтрШаблон("Модель ""%1"" уже есть в списке!",
			ТекущаяСтрока.Модель));
		Если НоваяСтрока Тогда
			Элемент.ЗакончитьРедактированиеСтроки(Истина);
		КонецЕсли;
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПроверитьНаличиеДубля(ДанныеСтроки)
	
	ПараметрыПоиска = Новый Структура("Модель", ДанныеСтроки.Модель);
	НайденныеСтроки = Объект.МодельПродукции.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() > 1 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НайденныеСтроки.Количество() = 1 Тогда
		Если НайденныеСтроки[0].ПолучитьИдентификатор() <> ДанныеСтроки.ПолучитьИдентификатор() Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти