
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    
    ПараметрыФайла  = Новый Структура;
    ПараметрыФайла .Вставить("ИдентификаторФормы", УникальныйИдентификатор);
    
    Результат = Ждать РаботаСФайломКлиент.ВыбратьФайл(ПараметрыФайла);
    
    Если Результат.ФайлВыбран Тогда
        Объект.ПутьКФайлу = Результат.ПутьКФайлу;
    Иначе
        ПоказатьПредупреждение(,"Файл не выбран");
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте   
Процедура Загрузить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Выберите файл для загрузки");
		Возврат;
	КонецЕсли;         
		ПрочитатьТабличныйДокументИзExcel(Объект.ПутьКФайлу);
		
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ТаблицаЗагрузки) Тогда
		ПоказатьПредупреждение(, "Загрузите файл в таблицу");
		Возврат;
	КонецЕсли; 
	
	СохранитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьКод7ки(Команда)
	
	ОчиститьКод7киНаСервере();
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции   

// Процедура - Прочитать табличный документ из excel
// считывает данные из файла *.xls, загружает их в таблицу значений и вызывает процедуру загрузки таблицы моделей в ТЧ  

// Параметры:
//  ПутьКФайлу		 - Строка	 - Путь к файлу загрузки
//  НомерЛистаExcel	 - Число	 - Если не указано, то 1
//
&НаСервере
Процедура ПрочитатьТабличныйДокументИзExcel(ПутьКФайлу, НомерЛистаExcel = 1)
	
	
	ТабДок = Новый ТабличныйДокумент; 
	
	Попытка
		ТабДок.Прочитать(ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();                                                        
		Возврат;
	КонецПопытки;
	
	Построитель = Новый ПостроительЗапроса; 
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область());
	Построитель.ЗаполнитьНастройки();
	Построитель.Выполнить();
	
	ТаблицаИзExcel = Построитель.Результат.Выгрузить();
	РаботаСФормамиСервер.ОбновитьДинамическуюТаблицу(ЭтотОбъект, "Объект.ТаблицаЗагрузки", "ТЗ","ДанныеЗагрузки", ТаблицаИзExcel); 
	ЗагрузитьТаблицуМоделей(ТаблицаИзExcel);
	
КонецПроцедуры // ()  

// Процедура - Загрузить таблицу моделей
// загружает выбранные из файла данные в табличную часть и ищет соответствующие им элементы в справочнике "модели продукции"  

// Параметры:
//  ТаблицаИзExcel - ТаблицаЗначений данные полученные при чтении файла *.Xls

&НаСервере
Процедура ЗагрузитьТаблицуМоделей(ТаблицаИзExcel)
	//создаем соответствие необходимых данных из таблицы значений   ключ - наименование модели; значение - код7ки
	ДанныеМоделей = Новый Соответствие; 
	ДанныеПоКоду = Новый Соответствие;
	// ищем наименование модели (наличие цифр в части наименования, содержащей код модели)
	Для каждого СтрокаДанных  Из ТаблицаИзExcel Цикл
		МассивПодстрок = СтрРазделить(СокрЛП(СтрокаДанных.Наименование)," ",Ложь); 
		//выбираем только элементы (по наличию цифр в наименовании)
		Для каждого Элемент Из МассивПодстрок Цикл 
			Для Индекс = 0 По СтрДлина(Элемент) Цикл
				ЕстьЧисло = Ложь;
				Символ = НРег(Сред(Элемент, Индекс, 1)); 
				Если СтрНайти("1234567890", Символ) Тогда					
					ЕстьЧисло = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьЧисло Тогда                        
				Наименование = ПодготовленнаяСтрока(СтрокаДанных.Наименование);        
				ДанныеМоделей.Вставить(Наименование,СтрокаДанных.Код); 
				ДанныеПоКоду.Вставить(СтрокаДанных.Код,СтрокаДанных.Наименование);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	  //находим элементы записанные в справочник
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МоделиПродукции.Ссылка КАК Ссылка,
	               |	МоделиПродукции.Наименование КАК Наименование,   
				   |	МоделиПродукции.Код КАК Код
	               |ИЗ
	               |	Справочник.МоделиПродукции КАК МоделиПродукции
	               |ГДЕ
	               |	НЕ МоделиПродукции.ЭтоГруппа";
	               
	Результат = Запрос.Выполнить();
		//ищем вхождение строки наименования элементов справочника  в название модели из файла 
	  
	  Выборка = Результат.Выбрать(); 
	  Пока Выборка.Следующий () Цикл   	  
		  НоваяСтрока = Объект.ТаблицаМоделей.Добавить();
		  НоваяСтрока.ДанныеСправочника = Выборка.Ссылка;
		  Наименование = ПодготовленнаяСтрока(Выборка.Наименование);
		  	
		  Для каждого Элемент Из ДанныеМоделей Цикл
			  Если СтрНайти(Элемент.Ключ,Наименование)>0  Тогда 
				      НоваяСтрока.Код7ки = Элемент.Значение; 
				  Для каждого Код Из ДанныеПоКоду Цикл
				      Если Код.Ключ = НоваяСтрока.Код7ки Тогда
				    	  НоваяСтрока.МодельИзФайла = код.Значение; 
				      КонецЕсли;
				  КонецЦикла;    
			  КонецЕсли;
		  КонецЦикла;
	  КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодготовленнаяСтрока(Стр) 
	// Последовательно вычищаем строку используя в каждом последующем операторе
	// результат выполнения предыдущего
	Результат = СтрЗаменить(Стр, Символ(32), ""); // не доверяю строковым константам 
	Результат = СтрЗаменить(Результат, Символ(45), ""); // обычный дефис (-)
	Результат = СтрЗаменить(Результат, Символ(8212), ""); // длинное тире  
	Результат = СтрЗаменить(Результат, Символ(8211), ""); // короткое тире  
	Результат = СтрЗаменить(Результат, Символы.НПП, ""); // неразырвный пробел, мало ли  
	Результат = СтрЗаменить(Результат, Символы.Таб, ""); // табуляция... а вдруг ?
	Результат = ВРег(Результат);    
	
	// Заменим в строке все символы кирилицы, совпадающие по написанию с латиницей,
	// на латиницу. Конечно такая замена каснется всей строки, а не только той ее
	// части, которая содержит кодировку моделей, но это не важно. Список символов
	// возьмем из интернета.
	СтрокаЛатиница  = "A,B,E,K,M,H,O,P,C,T,X";
	СтрокаКириллица = "А,В,Е,К,М,Н,О,Р,С,Т,Х";  
	// Символы в строка по порядку соответствуют один другому
	МассивЛатиница = СтрРазделить(СтрокаЛатиница, Символ(44));
	МассивКириллица = СтрРазделить(СтрокаКириллица, Символ(44));
	Для Сч = 0 По МассивКириллица.Количество() - 1 Цикл
		Результат = СтрЗаменить(Результат, МассивКириллица[Сч],	МассивЛатиница[Сч])
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции    
	
// Процедура - Сохранить на сервере
//  Проверяет заполненность код7ки в ТЧ формы и заполняет ее у соответствующих элементов справочника 
// 
&НаСервере
Процедура СохранитьНаСервере()
	 ДобавленоКодов = 0;
	 Для каждого СтрокаДанных Из Объект.ТаблицаМоделей Цикл
		 СсылкаНаЭлемент =  СтрокаДанных.ДанныеСправочника;
		Если ЗначениеЗаполнено(СтрокаДанных.Код7ки) Тогда
		     ЭлементОбъект = СсылкаНаЭлемент.ПолучитьОбъект();
			 ЭлементОбъект.Код7ки = СтрокаДанных.Код7ки;
			 ЭлементОбъект.Записать();		
		  ДобавленоКодов = ДобавленоКодов +1;
		КонецЕсли;
	КонецЦикла;	

	ТекстСообщенияПользователю = СтрШаблон("Изменено %1 элементов",ДобавленоКодов );
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьКод7киНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	МоделиПродукции.Ссылка КАК Ссылка,
	              |	МоделиПродукции.Код7ки КАК Код7ки
	              |ИЗ
	              |	Справочник.МоделиПродукции КАК МоделиПродукции
	              |ГДЕ
	              |	НЕ МоделиПродукции.ЭтоГруппа";
	              
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если ЗначениеЗаполнено(Выборка.Код7ки) Тогда
		     ЭлементОбъект = Выборка.Ссылка.ПолучитьОбъект();  
			 ЭлементОбъект.Код7ки = Неопределено;
			 ЭлементОбъект.Записать();
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

