
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    
    ПараметрыФайла  = Новый Структура;
    ПараметрыФайла .Вставить("ИдентификаторФормы", УникальныйИдентификатор);
    
    Результат = Ждать РаботаСФайломКлиент.ВыбратьФайл(ПараметрыФайла);
    
    Если Результат.ФайлВыбран Тогда
        Объект.ПутьКФайлу = Результат.ПутьКФайлу;
    Иначе
        ПоказатьПредупреждение(,"Файл не выбран");
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте   
Процедура Загрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Выберите файл для загрузки");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ТаблицаЗагрузки) Тогда
		ПоказатьПредупреждение(, "Загрузите файл в таблицу");
		Возврат;
	КонецЕсли; 
	
	СохранитьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере() 
	
	ТабЗнач = РаботаСCSVСервер.ПрочитатьФайлCSV(Объект.ПутьКФайлу);

	РаботаСФормамиСервер.ОбновитьДинамическуюТаблицу(ЭтотОбъект, "Объект.ТаблицаЗагрузки", "ТЗ","ДанныеЗагрузки", ТабЗнач);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ТаблицаЗначений = Объект.ТаблицаЗагрузки.Выгрузить();

	СозданоДокументов = 0;
	
	УникальныеКонтрагенты = Новый Массив;
	УникальныеСтатусы = Новый Массив;
	УникальныеОтчеты = Новый Массив;
	
	Для каждого СтрокаДанных Из ТаблицаЗначений Цикл
		Если УникальныеКонтрагенты.Найти(СтрокаДанных.service_center_id) = Неопределено Тогда
			УникальныеКонтрагенты.Добавить(СтрокаДанных.service_center_id);
		КонецЕсли;
		
		Если УникальныеСтатусы.Найти(СтрокаДанных.status) = Неопределено Тогда
			УникальныеСтатусы.Добавить(СтрокаДанных.status); 
		КонецЕсли;
		
		Если УникальныеОтчеты.Найти(СтрокаДанных.id) = Неопределено Тогда
			УникальныеОтчеты.Добавить(СтрокаДанных.id); 
		КонецЕсли;
	КонецЦикла;
	
	СоответствиеСервисныхЦентров = СоответсвияСервер.ПолучитьСоответствиеКонтрагентов(УникальныеКонтрагенты);
	СоответствиеСтатусовОтчета = СоответсвияСервер.ПолучитьСтатусыОтчета(УникальныеСтатусы);
	СоответствиеДокументовРемонта = СоответсвияСервер.ПолучитьСоответствиеДокументаРемонтПоОтчету(УникальныеОтчеты);
	
	
	Для каждого СтрокаДанных Из ТаблицаЗначений Цикл
		НовыйДокумент = Документы.ОтчетОРемонтах.СоздатьДокумент(); 
		НовыйДокумент.IDСайта = СтрокаДанных.id; 
		Дата = РаботаСоСтрокойСервер.ПреобразоватьСтрокуВДату(СтрокаДанных.report_date);
		НовыйДокумент.Дата = Дата;
		НовыйДокумент.ОтчетныйПериод = РаботаСоСтрокойСервер.МесяцГодИзДаты(Дата);
		
		ЧислоID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.service_center_id);
		НовыйДокумент.СервисныйЦентр = СоответствиеСервисныхЦентров[ЧислоID];
		НовыйДокумент.Статус = СоответствиеСтатусовОтчета[СтрокаДанных.status];
		
		// Добавляем ремонты, только если их количество > 0
		КлючОтчета = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.id);
		
		МассивРемонтов = СоответствиеДокументовРемонта[КлючОтчета];
		Если МассивРемонтов <> Неопределено Тогда
		    Для каждого СсылкаНаРемонт Из МассивРемонтов Цикл
		        НоваяСтрокаРемонта = НовыйДокумент.Ремонты.Добавить();
		        НоваяСтрокаРемонта.Ремонт = СсылкаНаРемонт; 
		    КонецЦикла;
		КонецЕсли;
		
		Если СоответствиеСтатусовОтчета[СтрокаДанных.status] = Перечисления.СтатусыОтчета.Оплачен ИЛИ
			СоответствиеСтатусовОтчета[СтрокаДанных.status] = Перечисления.СтатусыОтчета.ПринятУтвержден Тогда
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение)
		Иначе
			НовыйДокумент.Записать();
		КонецЕсли;

		СозданоДокументов = СозданоДокументов + 1;
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю; 
	Текст = СтрШаблон("Загружено и создано %1 документов ", СозданоДокументов);
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

КонецПроцедуры


#КонецОбласти

