
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СсылкаОтчет1.Заголовок = "Анализ по виду продукции";
	Элементы.СсылкаОтчет1.Шрифт = Новый Шрифт(, 12, Истина);
	Элементы.ОписаниеОтчет1.Заголовок = "Отчет по виду продукции в разрезе 
	|количества, процента затрат на ремонт, 
	|суммы ремонта";

	Элементы.СсылкаОтчет2.Заголовок = "Анализ по сроку службы до попадания в ремонт (вид продукции)";
	Элементы.СсылкаОтчет2.Шрифт = Новый Шрифт(, 12, Истина);
	Элементы.ОписаниеОтчет2.Заголовок = "Отчет по виду продукции в разрезе 
	|количества, процента затрат на ремонт, 
	|суммы ремонта по сроку службы";
	
	Элементы.СсылкаОтчет3.Заголовок = "Анализ по виду заводской продукции";
	Элементы.СсылкаОтчет3.Шрифт = Новый Шрифт(, 12, Истина);
	Элементы.ОписаниеОтчет3.Заголовок = "Отчет по виду продукции в разрезе 
	|количества, процента затрат на ремонт, 
	|суммы ремонта по производствам";

	Элементы.СсылкаОтчет4.Заголовок = "Анализ по группам моделей продукции";
	Элементы.СсылкаОтчет4.Шрифт = Новый Шрифт(, 12, Истина);
	Элементы.ОписаниеОтчет4.Заголовок = "Отчет по группам продукции в разрезе 
	|количества, процента затрат на ремонт, 
	|суммы ремонта";

	Элементы.СсылкаОтчет5.Заголовок = "Анализ по сроку службы до попадания в ремонт (группы моделей)";
	Элементы.СсылкаОтчет5.Шрифт = Новый Шрифт(, 12, Истина);
	Элементы.ОписаниеОтчет5.Заголовок = "Отчет по группам продукции в разрезе 
	|количества, процента затрат на ремонт, 
	|суммы ремонта по сроку службы";
				
	Элементы.СсылкаОтчет6.Заголовок = "Анализ по группам моделей и кодам неисправности";
	Элементы.СсылкаОтчет6.Шрифт = Новый Шрифт(, 12, Истина);
	Элементы.ОписаниеОтчет6.Заголовок = "Отчет по виду продукции в разрезе 
	|количества, процента затрат на ремонт, 
	|суммы ремонта по кодам неисправности";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СсылкаОтчет1Нажатие(Элемент)
	ОткрытьФорму("Отчет.ИтогиПоВидамПродукции.Форма",,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОтчет2Нажатие(Элемент)
	ОткрытьФорму("Отчет.ИтогиПоВидамПродукцииПоСрокуСлужбы.Форма",,, Истина);
КонецПроцедуры 

&НаКлиенте
Процедура СсылкаОтчет3Нажатие(Элемент)
	ОткрытьФорму("Отчет.ИтогиПоВидамЗаводскойПродукции.Форма",,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОтчет4Нажатие(Элемент)
	ОткрытьФорму("Отчет.ИтогиПоГруппамМоделей.Форма",,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОтчет5Нажатие(Элемент)
	ОткрытьФорму("Отчет.ИтогиПоГруппамМоделейПоСрокуСлужбы.Форма",,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОтчет6Нажатие(Элемент)
	ОткрытьФорму("Отчет.ИтогиПоГруппамМоделейИКодовНеисправности.Форма",,, Истина);
КонецПроцедуры

#КонецОбласти