#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем дерево 
	ДобавитьПодсистемуВСписок(Метаданные.Подсистемы.ОтчетыСлужебная, СписокОтчетов);
	
	// Создаем элементы формы
	СоздатьЭлементыФормы(СписокОтчетов, Элементы.ГруппаОсновная);	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьПодсистемуВСписок(Подсистема, ГруппаЭлементовДерева)
	
	// Находим в подсистеме и добавляем в дерево отчеты
	ДовитьОтчетыВСписок(Подсистема, ГруппаЭлементовДерева);
	
	// Находим вложенные подсистемы и рекурсивно дабавляем в дерево их и их содержимое
	Для Каждого ТекПодсистема Из Подсистема.Подсистемы Цикл
		СписокЭлементов = ГруппаЭлементовДерева.ПолучитьЭлементы();
		НовыйЭлемент = СписокЭлементов.Добавить();
		НовыйЭлемент.Заголовок = ТекПодсистема.Синоним;
		НовыйЭлемент.Имя = ТекПодсистема.Имя;
		НовыйЭлемент.ЭтоПодсистема = Истина;
		ДобавитьПодсистемуВСписок(ТекПодсистема, НовыйЭлемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДовитьОтчетыВСписок(Подсистема, ГруппаЭлементовДерева)

	Для Каждого Элемент Из Подсистема.Состав Цикл
			
		// Получаем имя элемента и ищем его в Отчетах
		Наименование = Элемент.Имя;
		Отчет = Метаданные.Отчеты.Найти(Наименование);
		Если Отчет = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Записываем данные об Отчете в дерево
		Список = ГруппаЭлементовДерева.ПолучитьЭлементы();
		НовыйОтчет = Список.Добавить();
		НовыйОтчет.Заголовок = Отчет.Синоним;
		НовыйОтчет.Описание = Отчет.Пояснение;
		НовыйОтчет.Имя = Отчет.Имя;
		
		// Ищем сохраненные пользователями варианты, создаем и записываем дочернюю ветвь
		Варианты = ХранилищеВариантовОтчетов.ПолучитьСписок(Отчет.ПолноеИмя());
		Для Каждого Вариант Из Варианты Цикл
			СписокВариантов = НовыйОтчет.ПолучитьЭлементы();
			ВариантОтчета = СписокВариантов.Добавить();
			ВариантОтчета.Заголовок = Вариант.Представление;
			ВариантОтчета.Имя = НовыйОтчет.Имя;
			ВариантОтчета.КлючВарианта = Вариант.Значение;
			ВариантОтчета.ЭтоВариант = Истина;
		КонецЦикла;			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыФормы(Дерево, Группа)
	
	ГруппаЭлементовДерева = Дерево.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ГруппаЭлементовДерева Цикл
		
		Если ЭлементДерева.ЭтоПодсистема Тогда
			НоваяГруппаПодсистемы = Элементы.Добавить("Группа" + ЭлементДерева.Имя, Тип("ГруппаФормы"), Группа);
			НоваяГруппаПодсистемы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппаПодсистемы.Заголовок = ЭлементДерева.Заголовок;
			НоваяГруппаПодсистемы.ШрифтЗаголовка = ШрифтыСтиля.ШрифтЗаголовкаОтчетов;
	    	НоваяГруппаПодсистемы.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	    	НоваяГруппаПодсистемы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	    	СоздатьЭлементыФормы(ЭлементДерева, НоваяГруппаПодсистемы);	
		Иначе
			// Создаем ссылки для осноновных вариантов отчета
			СоздатьЭлементФормыСсылку(ЭлементДерева, Группа);
			
			// Создаем группу ссылок для пользовательских вариантов
			Варианты = ЭлементДерева.ПолучитьЭлементы();
			Если Варианты.Количество() > 0 Тогда
				НоваяГруппа = Элементы.Добавить("Группа" + ЭлементДерева.Имя, Тип("ГруппаФормы"), Группа);
				НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				НоваяГруппа.ОтображатьЗаголовок = Ложь;
	    		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	    		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;	    		
	    		Для Каждого Вариант Из Варианты Цикл
	    			СоздатьЭлементФормыСсылку(Вариант, НоваяГруппа);
	    		КонецЦикла;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементФормыСсылку(Отчет, Группа)
	
	НовыйЭлемент = Элементы.Добавить("Отчет" + Отчет.ПолучитьИдентификатор(), Тип("ДекорацияФормы"), Группа);
	НовыйЭлемент.Заголовок = Отчет.Заголовок;
	//НовыйЭлемент.Шрифт = ШрифтыСтиля.ШрифтЗаголовкаОтчетов;
	НовыйЭлемент.Гиперссылка = Истина;	
	НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	НовыйЭлемент.Подсказка = Отчет.Описание;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_НажатиеНавигационнойСсылки");

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНавигационнойСсылки(Элемент)
	// Из наименования элемента формы выделяем индекс элемента дерева
	ИдОтчета = Число(Сред(Элемент.Имя, 6));
	
	Отчет = СписокОтчетов.НайтиПоИдентификатору(ИдОтчета);
	Если Отчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Отчет.ЭтоВариант Тогда
		КлючВарианта = Отчет.КлючВарианта;
	Иначе
		// Что бы открыть отчет без каких-либо пользовательских настрое надо определить
		// имя основного варианта
		КлючВарианта = ПолучитьИмяОсновногоВариантаНаСервере(Отчет.Имя);
	КонецЕсли;
	СсылкаНаОтчет = СтрШаблон("e1cib/app/Отчет.%1?vrn=%2", Отчет.Имя, КлючВарианта);
	ПерейтиПоНавигационнойСсылке(СсылкаНаОтчет);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяОсновногоВариантаНаСервере(ИмяОтчета)
	
	ОтчетОбъект = Отчеты[ИмяОтчета].Создать();
	ИмяВарианта = ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек[0].Имя;
	
	Возврат ИмяВарианта;
	
КонецФункции

#КонецОбласти