Функция ДанныеОтчета(ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "

	|ВЫБРАТЬ
	|	Ремонты.Период КАК Период,
	|	Ремонты.Регистратор КАК Регистратор,
	|	Ремонты.НомерСтроки КАК НомерСтроки,
	|	Ремонты.ВидПродукции КАК ВидПродукции,
	|	Ремонты.МодельПродукции КАК МодельПродукции,
	|	Ремонты.КодНеисправности КАК КодНеисправности,
	|	Ремонты.СуммаИтого КАК СуммаИтого,
	|	Ремонты.Количество КАК Количество,
	|	Контрагенты.СервисныйЦентр КАК СервисныйЦентр,
	|	Контрагенты.СрокВЭксплуатации КАК СрокВЭксплуатации,
	|	Фабрики.Фабрика КАК Фабрика,
	|	Фабрики.Смена КАК Смена,
	|	ГруппыМоделей.Ссылка КАК ГруппыМоделей
	|ИЗ
	|	РегистрНакопления.РемонтыИПродукция КАК Ремонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КонтрагентыИДата КАК Контрагенты
	|	ПО Ремонты.Регистратор = Контрагенты.Регистратор
	|		И Ремонты.НомерСтроки = Контрагенты.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ФабрикиИСмены КАК Фабрики
	|	ПО Ремонты.Регистратор = Фабрики.Регистратор
	|		И Ремонты.НомерСтроки = Фабрики.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыМоделей КАК ГруппыМоделей
	|	ПО Ремонты.МодельПродукции = ГруппыМоделей.МодельПродукции.Модель
	|ГДЕ
		|Ремонты.Период МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции
