
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Данные.ВидДокумента = Перечисления.ВидДокументаПродажиИПроизводство.Продажи Тогда
		ИмяВида = "Отчет о Продажах";
	Иначе
		ИмяВида = "Отчет о Производстве";		
	КонецЕсли;	
	Представление = СтрШаблон("%1 %2 от %3", ИмяВида, Данные.Номер, Данные.Дата);
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ВидДокумента");

КонецПроцедуры

#КонецОбласти
