#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекДата = ТекущаяДатаСеанса();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ТекущийГод = Год(ДобавитьМесяц(ТекДата, -12));
	ПриИзмененииТекущегоГода();
	
	ДанныеОбщие = ПолучтьДанныеЗаГодНаСервере(ТекДата);	
	ЗаполнитьТаблицуИтоговЗаГод(ДанныеЗаВесьПериод, ДанныеОбщие);
	ЗаполнитьТаблицуСтатусовОтчетов();

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УменьшитьГод(Команда)
	
	Если ТекущийГод > 2022 Тогда
		ТекущийГод = ТекущийГод - 1;
		ПриИзмененииТекущегоГода();
	КонецЕсли;
	Элементы.УменьшитьГод.Доступность = (ТекущийГод > 2022);
	Элементы.УвеличитьГод.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьГод(Команда)
	
	ЭтотГод = Год(ТекДата);
	Если ТекущийГод < ЭтотГод Тогда
		ТекущийГод = ТекущийГод + 1;
		ПриИзмененииТекущегоГода();
	КонецЕсли;
	Элементы.УменьшитьГод.Доступность = Истина;
	Элементы.УвеличитьГод.Доступность = (ТекущийГод < ЭтотГод);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииТекущегоГода()
	
	Элементы.ТекГод.Заголовок = Формат(ТекущийГод, "ЧГ=;");
	ДанныеЗаГод = ПолучтьДанныеЗаГодНаСервере(ТекДата, ТекущийГод);
	ЗаполнитьТаблицуИтоговЗаГод(ДанныеЗаПрошедшийГод, ДанныеЗаГод);

	ДиаграммаЗаГод.Очистить();	
	Для Сч = 0 По 3 Цикл
		СтрДанных = ДанныеЗаГод[Сч];
		Точка = ДиаграммаЗаГод.УстановитьТочку("Сумма");
		Серия = ДиаграммаЗаГод.УстановитьСерию(СтрДанных.Продукция);
		ДиаграммаЗаГод.УстановитьЗначение(Точка, Серия, СтрДанных.РемонтСумма);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуИтоговЗаГод(Таблица, ДанныеЗаГод)

	Таблица.Очистить();
	Для Каждого СтрДанных Из ДанныеЗаГод Цикл
		НоваяСтрока = Таблица.Добавить();
		Для Каждого Колонка Из СтрДанных Цикл
			НоваяСтрока[Колонка.Ключ] = Колонка.Значение;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучтьДанныеЗаГодНаСервере(ТекДата, Год = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыПродукции.Наименование КАК Наименование,
	|	АктыПродукцияИКодОбороты.КоличествоОборот КАК Списано,
	|	ПродажиОбороты.КоличествоОборот КАК Продажи,
	|	ПроизводствоОбороты.КоличествоОборот КАК Производство,
	|	РемонтыИПродукцияОбороты.КоличествоОборот КАК Ремонт,
	|	РемонтыИПродукцияОбороты.СуммаИтогоОборот КАК РемонтСумма,
	|	ВидыПродукции.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыПродукции КАК ВидыПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РемонтыИПродукция.Обороты(&НачалоПериода, &КонецПериода) КАК
	|			РемонтыИПродукцияОбороты
	|		ПО ВидыПродукции.Ссылка = РемонтыИПродукцияОбороты.ВидПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АктыПродукцияИКод.Обороты(&НачалоПериода, &КонецПериода) КАК
	|			АктыПродукцияИКодОбороты
	|		ПО ВидыПродукции.Ссылка = АктыПродукцияИКодОбороты.ВидПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода) КАК ПродажиОбороты
	|		ПО ВидыПродукции.Ссылка = ПродажиОбороты.ВидПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Производство.Обороты(&НачалоПериода, &КонецПериода) КАК ПроизводствоОбороты
	|		ПО ВидыПродукции.Ссылка = ПроизводствоОбороты.ВидПродукции
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕСТЬNULL(СуммаИтогоОборот, 0) УБЫВ";
	
	Если Год = Неопределено Тогда
		НачалоПериода = НачалоДня(Дата(2008, 1, 1));
		КонецПериода = КонецДня(ТекДата);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Иначе
		ПериодГод = Дата(Год, 1, 1);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПериодГод));
		Запрос.УстановитьПараметр("КонецПериода", КонецГода(ПериодГод));
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		СтрДанных = Новый Структура;
		СтрДанных.Вставить("Продукция", Выборка.Ссылка);
		СтрДанных.Вставить("Продажи", Выборка.Продажи);
		СтрДанных.Вставить("Производство", Выборка.Производство);
		СтрДанных.Вставить("Списано", Выборка.Списано);
		СтрДанных.Вставить("РемонтКоличество", Выборка.Ремонт);
		СтрДанных.Вставить("РемонтСумма", Выборка.РемонтСумма);
		Результат.Добавить(СтрДанных);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуСтатусовОтчетов()

	ДанныеОСтатусахОтчетов = Новый Соответствие;
	ДанныеОСтатусахОтчетов.Вставить(ПредопределенноеЗначение("Перечисление.СтатусыОтчета.Оплачен"));
	ДанныеОСтатусахОтчетов.Вставить(ПредопределенноеЗначение("Перечисление.СтатусыОтчета.ПринятУтвержден"));
	ДанныеОСтатусахОтчетов.Вставить(ПредопределенноеЗначение("Перечисление.СтатусыОтчета.ПроверенМенеджером"));
	ДанныеОСтатусахОтчетов.Вставить(ПредопределенноеЗначение("Перечисление.СтатусыОтчета.ПринятНаПроверку"));
	ДанныеОСтатусахОтчетов.Вставить(ПредопределенноеЗначение("Перечисление.СтатусыОтчета.ОтправленПовторно"));
	ДанныеОСтатусахОтчетов.Вставить(ПредопределенноеЗначение("Перечисление.СтатусыОтчета.НаДоработке"));
	ДанныеОСтатусахОтчетов.Вставить(ПредопределенноеЗначение("Перечисление.СтатусыОтчета.ОтправленНаПроверку"));
	ДанныеОСтатусахОтчетов.Вставить(ПредопределенноеЗначение("Перечисление.СтатусыОтчета.Черновик"));
	
	ЗаполнитьСтатусыОтчетовНаСервере(ДанныеОСтатусахОтчетов);
	
	Для Каждого СтрДанных Из ДанныеОСтатусахОтчетов Цикл
		НоваяСтрока = СтатусыОтчетов.Добавить();
		НоваяСтрока.Статус = СтрДанных.Ключ;
		НоваяСтрока.Количество = СтрДанных.Значение;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСтатусыОтчетовНаСервере(Данные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтчетОРемонтах.Статус КАК Статус,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОтчетОРемонтах.Ссылка) КАК Количество
	|ИЗ
	|	Документ.ОтчетОРемонтах КАК ОтчетОРемонтах
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРемонтах.Статус";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Данные.Вставить(Выборка.Статус, Выборка.Количество);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти